In [1]:
import pandas as pd
import numpy as np
import re 
from fuzzywuzzy import fuzz, process
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.cluster import AgglomerativeClustering
from sklearn.cluster import KMeans
from nltk.corpus import stopwords
#import cleanco
import functools
import operator
from collections import OrderedDict
import re
import unicodedata

## Recreate Cleanco

In [2]:
#Term data
terms_by_type = {
   'Corporation': ['company', 'incorporated', 'corporation', 'corp.', 'corp', 'inc',
      '& co.', '& co', 'inc.', 's.p.a.', 'n.v.', 'a.g.', 'ag', 'nuf', 's.a.', 's.f.',
      'oao', 'co.', 'co'
   ],
   'General Partnership': ['soc.col.', 'stg', 'd.n.o.', 'ltda.', 'v.o.s.', 'a spol.',
      u've\xc5\x99. obch. spol.', 'kgaa', 'o.e.', 's.f.', 's.n.c.', 's.a.p.a.', 'j.t.d.',
      'v.o.f.', 'sp.j.', 'og', 'sd', ' i/s', 'ay', 'snc', 'oe', 'bt.', 's.s.', 'mb',
      'ans', 'da', 'o.d.', 'hb', 'pt'
   ],
   'Joint Stock / Unlimited': ['unltd', 'ultd', 'sal', 'unlimited', 'saog', 'saoc', 'aj',
      'yoaj', 'oaj', 'akc. spol.', 'a.s.'
   ],
   'Joint Venture': ['esv', 'gie', 'kv.', 'qk'],
   'Limited': ['pty. ltd.', 'pty ltd', 'ltd', 'l.t.d.', 'bvba', 'd.o.o.', 'ltda', 'gmbh',
      'g.m.b.h', 'kft.', 'kht.', 'zrt.', 'ehf.', 's.a.r.l.', 'd.o.o.e.l.', 's. de r.l.',
      'b.v.', 'tapui',
      'sp. z.o.o.', 'sp. z o.o.', 'spółka z o.o.',
      's.r.l.', 's.l.', 's.l.n.e.', 'ood', 'oy', 'rt.',
      'teo', 'uab', 'scs', 'sprl', 'limited', 'bhd.', 'sdn. bhd.', 'sdn bhd', 'as',
      'lda.', 'tov', 'pp'
   ],
   'Limited Liability Company': ['pllc', 'llc', 'l.l.c.', 'plc.', 'plc', 'hf.', 'oyj',
      'a.e.', 'nyrt.', 'p.l.c.', 'sh.a.', 's.a.', 's.r.l.', 'srl.', 'srl', 'aat', '3at', 'd.d.',
      's.r.o.', 'spol. s r.o.', 's.m.b.a.', 'smba', 'sarl', 'nv', 'sa', 'aps',
      'a/s', 'p/s', 'sae', 'sasu', 'eurl', 'ae', 'cpt', 'as', 'ab', 'asa', 'ooo', 'dat',
      'vat', 'zat', 'mchj', 'a.d.'
   ],
   'Limited Liability Limited Partnership': ['lllp', 'l.l.l.p.'],
   'Limited Liability Partnership': ['llp', 'l.l.p.', 'sp.p.', 's.c.a.', 's.c.s.'],
   'Limited Partnership': ['gmbh & co. kg', 'lp', 'l.p.', 's.c.s.',
      's.c.p.a', 'comm.v', 'k.d.', 'k.d.a.', 's. en c.', 'e.e.', 's.a.s.', 's. en c.',
      'c.v.', 's.k.a.', 'sp.k.', 's.cra.', 'ky', 'scs', 'kg', 'kd', 'k/s', 'ee', 'secs',
      'kda', 'ks', 'kb','kt'
   ],
   'Mutual Fund': ['sicav'],
   'No Liability': ['nl'],
   'Non-Profit': ['vzw', 'ses.', 'gte.'],
   'Private Company': ['private', 'pte', 'xk'],
   'Professional Corporation': ['p.c.', 'vof', 'snc'],
   'Professional Limited Liability Company': ['pllc', 'p.l.l.c.'],
   'Sole Proprietorship': ['e.u.', 's.p.', 't:mi', 'tmi', 'e.v.', 'e.c.', 'et', 'obrt',
      'fie', 'ij', 'fop', 'xt'
   ]
}

terms_by_country = {
   'Albania': ['sh.a.', 'sh.p.k.'],
   'Argentina': ['s.a.', 's.r.l.', 's.c.p.a', 'scpa', 's.c.e i.', 's.e.', 's.g.r',
      'soc.col.'
   ],
   'Australia': ['nl', 'pty. ltd.', 'pty ltd'],
   'Austria': ['e.u.', 'stg', 'gesbr', 'a.g.', 'ag', 'og', 'kg'],
   'Belarus': ['aat', '3at'],
   'Belgium': ['esv', 'vzw', 'vof', 'snc', 'comm.v', 'scs', 'bvba', 'sprl', 'cvba',
      'cvoa', 'sca', 'sep', 'gie'
   ],
   'Bosnia / Herzegovina': ['d.d.', 'a.d.', 'd.n.o.', 'd.o.o.', 'k.v.', 's.p.'],
   'Brazil': ['ltda', 's.a.', 'pllc', 'ad', 'adsitz', 'ead', 'et', 'kd', 'kda', 'sd'],
   'Bulgaria': ['ad', 'adsitz', 'ead', 'et', 'kd', 'kda', 'sd'],
   'Cambodia': ['gp', 'sm pte ltd.', 'pte ltd.', 'plc ltd.', 'peec', 'sp'],
   'Canada': ['gp', 'lp', 'sp'],
   'Chile': ['eirl', 's.a.', 'sgr', 's.g.r.', 'ltda', 's.p.a.', 'sa', 's. en c.',
      'ltda.'
   ],
   'Columbia': ['s.a.', 'e.u.', 's.a.s.', 'suc. de descendants', 'sca'],
   'Croatia': ['d.d.', 'd.o.o.', 'obrt'],
   'Czech Republic': ['a.s.', 'akc. spol.', 's.r.o.', 'spol. s r.o.', 'v.o.s.', u've\xc5\x99. obch. spol.', 'a spol.', 'k.s.', 'kom. spol.', 'kom. spol.'],
   'Denmark': ['i/s', 'a/s', 'k/s', 'p/s', 'amba', 'a.m.b.a.', 'fmba', 'f.m.b.a.', 'smba',
      's.m.b.a.', 'g/s'
   ],
   'Dominican Republic': ['c. por a.', 'cxa', 's.a.', 's.a.s.', 'srl.', 'srl', 'eirl.', 'sa',
      'sas'
   ],
   'Ecuador': ['s.a.', 'c.a.', 'sa', 'ep'],
   'Egypt': ['sae'],
   'Estonia': ['fie'],
   'Finland': ['t:mi', 'tmi', 'as oy', 'as.oy', 'ay', 'ky', 'oy', 'oyj', 'ok'],
   'France': ['sicav', 'sarl', 'sogepa', 'ei', 'eurl', 'sasu', 'fcp', 'gie', 'sep', 'snc',
      'scs', 'sca', 'scop', 'sem', 'sas'
   ],
   'Germany': ['gmbh & co. kg', 'e.g.', 'e.v.', 'gbr', 'ohg', 'partg',
      'kgaa', 'gmbh', 'g.m.b.h.', 'ag', 'mbh & co. kg'
   ],
   'Greece': ['a.e.', 'ae', 'e.e.', 'ee', 'epe', 'e.p.e.', 'mepe', 'm.e.p.e.', 'o.e.',
      'oe', 'ovee', 'o.v.e.e.'
   ],
   'Guatemala': ['s.a.', 'sa'],
   'Haiti': ['sa'],
   'Hong Kong': ['ltd', 'unltd', 'ultd', 'limited'],
   'Hungary': ['e.v.', 'e.c.', 'bt.', 'kft.', 'kht.', 'kkt.', 'k.v.', 'zrt.', 'nyrt',
      'ev', 'ec', 'rt.'
   ],
   'Iceland': ['ehf.', 'hf.', 'ohf.', 's.f.', 'ses.'],
   'India': ['pvt. ltd.', 'ltd.', 'psu', 'pse'],
   'Indonesia': ['ud', 'fa', 'pt'],
   'Ireland': ['cpt', 'teo'],
   'Israel': ['b.m.', 'bm', 'ltd', 'limited'],
   'Italy': ['s.n.c.', 's.a.s.', 's.p.a.', 's.a.p.a.', 's.r.l.', 's.c.r.l.', 's.s.'],
   'Latvia': ['as', 'sia', 'ik', 'ps', 'ks'],
   'Lebanon': ['sal'],
   'Lithuania': ['uab', 'ab', 'ij', 'mb'],
   'Luxemborg': ['s.a.', 's.a.r.l.', 'secs'],
   'Macedonia': ['d.o.o.', 'd.o.o.e.l', 'k.d.a.', 'j.t.d.', 'a.d.', 'k.d.'],
   'Malaysia': ['bhd.', 'sdn. bhd.'],
   'Mexico': ['s.a.', 's. de. r.l.', 's. en c.', 's.a.b.', 's.a.p.i.'],
   'Mongolia': ['xk', 'xxk'],
   'Netherlands': ['v.o.f.', 'c.v.', 'b.v.', 'n.v.'],
   'New Zealand': ['tapui', 'ltd', 'limited'],
   'Nigeria': ['gte.', 'plc', 'ltd.', 'ultd.'],
   'Norway': ['asa', 'as', 'ans', 'ba', 'bl', 'da', 'etat', 'fkf', 'hf', 'iks', 'kf',
      'ks', 'nuf', 'rhf', 'sf'
   ],
   'Oman': ['saog', 'saoc'],
   'Pakistan': ['ltd.', 'pvt. ltd.', 'ltd', 'limited'],
   'Peru': ['sa', 's.a.', 's.a.a.'],
   'Philippines': ['coop.', 'corp.', 'corp', 'ent.', 'inc.', 'inc', 'llc', 'l.l.c.',
      'ltd.'
   ],
   'Poland': ['p.p.', 's.k.a.', 'sp.j.', 'sp.k.', 'sp.p.', 'sp. z.o.o.', 's.c.', 's.a.'],
   'Portugal': ['lda.', 'crl', 's.a.', 's.f.', 'sgps'],
   'Romania': ['s.c.a.', 's.c.s.', 's.n.c.', 's.r.l.', 'o.n.g.', 's.a.'],
   'Russia': ['ooo', 'oao', 'zao', '3ao', 'пао', 'оао', 'ооо'],
   'Serbia': ['d.o.o.', 'a.d.', 'k.d.', 'o.d.'],
   'Singapore': ['bhd', 'pte ltd', 'sdn bhd', 'llp', 'l.l.p.', 'ltd.', 'pte', 'pte. ltd.'],
   'Slovenia': ['d.d.', 'd.o.o.', 'd.n.o.', 'k.d.', 's.p.'],
   'Slovakia': ['a.s.', 'akc. spol.', 's.r.o.', 'spol. s r.o.', 'k.s.', 'kom. spol.', 'v.o.s.', 'a spol.'],
   'Spain': ['s.a.', 's.a.d.', 's.l.', 's.l.l.', 's.l.n.e.', 's.c.', 's.cra', 's.coop',
      'sal', 'sccl'
   ],
   'Sweden': ['ab', 'hb', 'kb'],
   'Switzerland': ['ab', 'sa', 'gmbh', 'g.m.b.h.', 'sarl', 'sagl'],
   'Turkey': ['koop.'],
   'Ukraine': ['dat', 'fop', 'kt', 'pt', 'tdv', 'tov', 'pp', 'vat', 'zat', 'at'],
   'United Kingdom': ['plc.', 'plc', 'cic', 'cio', 'l.l.p.', 'llp', 'l.p.', 'lp', 'ltd.',
      'ltd', 'limited'
   ],
   'United States of America': ['llc', 'inc.', 'corporation', 'incorporated', 'company',
      'limited', 'corp.', 'inc.', 'inc', 'llp', 'l.l.p.', 'pllc', 'and company',
      '& company', 'inc', 'inc.', 'corp.', 'corp', 'ltd.', 'ltd', '& co.', '& co', 'co.',
      'co', 'lp'
   ],
   'Uzbekistan': ['mchj', 'qmj', 'aj', 'oaj', 'yoaj', 'xk', 'xt', 'ok', 'uk', 'qk']
}

In [3]:
# from https://stackoverflow.com/a/51230541
NON_NFKD_MAP = {
    u"\u0181": u"B",
    u"\u1d81": u"d",
    u"\u1d85": u"l",
    u"\u1d89": u"r",
    u"\u028b": u"v",
    u"\u1d8d": u"x",
    u"\u1d83": u"g",
    u"\u0191": u"F",
    u"\u0199": u"k",
    u"\u019d": u"N",
    u"\u0220": u"N",
    u"\u01a5": u"p",
    u"\u0224": u"Z",
    u"\u0126": u"H",
    u"\u01ad": u"t",
    u"\u01b5": u"Z",
    u"\u0234": u"l",
    u"\u023c": u"c",
    u"\u0240": u"z",
    u"\u0142": u"l",
    u"\u0244": u"U",
    u"\u2c60": u"L",
    u"\u0248": u"J",
    u"\ua74a": u"O",
    u"\u024c": u"R",
    u"\ua752": u"P",
    u"\ua756": u"Q",
    u"\ua75a": u"R",
    u"\ua75e": u"V",
    u"\u0260": u"g",
    u"\u01e5": u"g",
    u"\u2c64": u"R",
    u"\u0166": u"T",
    u"\u0268": u"i",
    u"\u2c66": u"t",
    u"\u026c": u"l",
    u"\u1d6e": u"f",
    u"\u1d87": u"n",
    u"\u1d72": u"r",
    u"\u2c74": u"v",
    u"\u1d76": u"z",
    u"\u2c78": u"e",
    u"\u027c": u"r",
    u"\u1eff": u"y",
    u"\ua741": u"k",
    u"\u0182": u"B",
    u"\u1d86": u"m",
    u"\u0288": u"t",
    u"\u018a": u"D",
    u"\u1d8e": u"z",
    u"\u0111": u"d",
    u"\u0290": u"z",
    u"\u0192": u"f",
    u"\u1d96": u"i",
    u"\u019a": u"l",
    u"\u019e": u"n",
    u"\u1d88": u"p",
    u"\u02a0": u"q",
    u"\u01ae": u"T",
    u"\u01b2": u"V",
    u"\u01b6": u"z",
    u"\u023b": u"C",
    u"\u023f": u"s",
    u"\u0141": u"L",
    u"\u0243": u"B",
    u"\ua745": u"k",
    u"\u0247": u"e",
    u"\ua749": u"l",
    u"\u024b": u"q",
    u"\ua74d": u"o",
    u"\u024f": u"y",
    u"\ua751": u"p",
    u"\u0253": u"b",
    u"\ua755": u"p",
    u"\u0257": u"d",
    u"\ua759": u"q",
    u"\xd8": u"O",
    u"\u2c63": u"P",
    u"\u2c67": u"H",
    u"\u026b": u"l",
    u"\u1d6d": u"d",
    u"\u1d71": u"p",
    u"\u0273": u"n",
    u"\u1d75": u"t",
    u"\u1d91": u"d",
    u"\xf8": u"o",
    u"\u2c7e": u"S",
    u"\u1d7d": u"p",
    u"\u2c7f": u"Z",
    u"\u0183": u"b",
    u"\u0187": u"C",
    u"\u1d80": u"b",
    u"\u0289": u"u",
    u"\u018b": u"D",
    u"\u1d8f": u"a",
    u"\u0291": u"z",
    u"\u0110": u"D",
    u"\u0193": u"G",
    u"\u1d82": u"f",
    u"\u0197": u"I",
    u"\u029d": u"j",
    u"\u019f": u"O",
    u"\u2c6c": u"z",
    u"\u01ab": u"t",
    u"\u01b3": u"Y",
    u"\u0236": u"t",
    u"\u023a": u"A",
    u"\u023e": u"T",
    u"\ua740": u"K",
    u"\u1d8a": u"s",
    u"\ua744": u"K",
    u"\u0246": u"E",
    u"\ua748": u"L",
    u"\ua74c": u"O",
    u"\u024e": u"Y",
    u"\ua750": u"P",
    u"\ua754": u"P",
    u"\u0256": u"d",
    u"\ua758": u"Q",
    u"\u2c62": u"L",
    u"\u0266": u"h",
    u"\u2c73": u"w",
    u"\u2c6a": u"k",
    u"\u1d6c": u"b",
    u"\u2c6e": u"M",
    u"\u1d70": u"n",
    u"\u0272": u"n",
    u"\u1d92": u"e",
    u"\u1d74": u"s",
    u"\u2c7a": u"o",
    u"\u2c6b": u"Z",
    u"\u027e": u"r",
    u"\u0180": u"b",
    u"\u0282": u"s",
    u"\u1d84": u"k",
    u"\u0188": u"c",
    u"\u018c": u"d",
    u"\ua742": u"K",
    u"\u1d99": u"u",
    u"\u0198": u"K",
    u"\u1d8c": u"v",
    u"\u0221": u"d",
    u"\u2c71": u"v",
    u"\u0225": u"z",
    u"\u01a4": u"P",
    u"\u0127": u"h",
    u"\u01ac": u"T",
    u"\u0235": u"n",
    u"\u01b4": u"y",
    u"\u2c72": u"W",
    u"\u023d": u"L",
    u"\ua743": u"k",
    u"\u0249": u"j",
    u"\ua74b": u"o",
    u"\u024d": u"r",
    u"\ua753": u"p",
    u"\u0255": u"c",
    u"\ua757": u"q",
    u"\u2c68": u"h",
    u"\ua75b": u"r",
    u"\ua75f": u"v",
    u"\u2c61": u"l",
    u"\u2c65": u"a",
    u"\u01e4": u"G",
    u"\u0167": u"t",
    u"\u2c69": u"K",
    u"\u026d": u"l",
    u"\u1d6f": u"m",
    u"\u0271": u"m",
    u"\u1d73": u"r",
    u"\u027d": u"r",
    u"\u1efe": u"Y",
}

In [4]:
def typesources():
    types = []
    for business_type in terms_by_type:
        for item in terms_by_type[business_type]:
            types.append((business_type, item))

    return sorted(types, key=lambda part: len(part[1]), reverse=True)


def countrysources():
    countries = []
    for country in terms_by_country:
        for item in terms_by_country[country]:
            countries.append((country, item))

    return sorted(countries, key=lambda part: len(part[1]), reverse=True)


def matches(name, sources):
    name = strip_tail(name)
    parts = name.split()
    nparts = [normalized(p) for p in parts]
    matches = []
    for classifier, term in sources:
        nterm = normalized(term)
        try:
            idx = nparts.index(nterm)
        except ValueError:
            pass
        else:
            matches.append(classifier)

    return matches

In [5]:
tail_removal_rexp = re.compile(r"[^\.\w\(\)]+$", flags=re.UNICODE)


def get_unique_terms():
    "retrieve all unique terms from termdata definitions"
    ts = functools.reduce(operator.iconcat, terms_by_type.values(), [])
    cs = functools.reduce(operator.iconcat, terms_by_country.values(), [])
    return set(ts + cs)


def remove_accents(t):
    """based on https://stackoverflow.com/a/51230541"""
    nfkd_form = unicodedata.normalize('NFKD', t.casefold())
    return ''.join(
        NON_NFKD_MAP[c]
            if c in NON_NFKD_MAP
        else c
            for part in nfkd_form for c in part
            if unicodedata.category(part) != 'Mn'
        )


def strip_punct(t):
    return t.replace(".", "").replace(",", "").replace("-", "")


def normalize_terms(terms):
    "normalize terms"
    return (strip_punct(remove_accents(t)) for t in terms)


def strip_tail(name):
    "get rid of all trailing non-letter symbols except the dot"
    match = re.search(tail_removal_rexp, name)
    if match is not None:
        name = name[: match.span()[0]]
    return name


def normalized(text):
    "caseless Unicode normalization"
    return remove_accents(text)


def prepare_default_terms():
    "construct an optimized term structure for basename extraction"
    terms = get_unique_terms()
    nterms = normalize_terms(terms)
    ntermparts = (t.split() for t in nterms)
    # make sure that the result is deterministic, sort terms descending by number of tokens, ascending by names
    sntermparts = sorted(ntermparts, key=lambda x: (-len(x), x))
    return [(len(tp), tp) for tp in sntermparts]


def custom_basename(name, terms, suffix=True, prefix=False, middle=False, **kwargs):
    "return cleaned base version of the business name"

    name = strip_tail(name)
    nparts = name.split()
    nname = normalized(name)
    nnparts = list(map(strip_punct, nname.split()))
    nnsize = len(nnparts)

    if suffix:
        for termsize, termparts in terms:
            if nnparts[-termsize:] == termparts:
                del nnparts[-termsize:]
                del nparts[-termsize:]

    if prefix:
        for termsize, termparts in terms:
            if nnparts[:termsize] == termparts:
                del nnparts[:termsize]
                del nparts[:termsize]

    if middle:
        for termsize, termparts in terms:
            if termsize > 1:
                sizediff = nnsize - termsize
                if sizediff > 1:
                    for i in range(0, nnsize-termsize+1):
                        if termparts == nnparts[i:i+termsize]:
                            del nnparts[i:i+termsize]
                            del nparts[i:i+termsize]
            else:
                if termparts[0] in nnparts[1:-1]:
                    idx = nnparts[1:-1].index(termparts[0])
                    del nnparts[idx+1]
                    del nparts[idx+1]


    return strip_tail(" ".join(nparts))


# convenience for most common use cases that don't parametrize base name extraction
basename = functools.partial(custom_basename, terms=prepare_default_terms())

In [6]:
terms = prepare_default_terms()

In [7]:
#Ensure Brackets are handled correctly
basename("Net Current Assets (Alpha IV)")

'Net Current Assets (Alpha IV)'

In [8]:
basename('11143646 Canada Inc')

'11143646 Canada'

In [9]:
basename('@hand Software Corporation')

'@hand Software'

In [10]:
basename('24 Mobile Advertsiing Solutions AB')

'24 Mobile Advertsiing Solutions'

## Company Names

In [ ]:
filename = 'OriginalCompanyNames.xlsx'
path = f'C:/Users/aneave/OneDrive/Documents/Naming Conventions/Standardising Company Names/{filename}'

In [ ]:
#Company Names
df = pd.read_excel(path)

In [ ]:
df['Cleaned Name'] = ''

In [ ]:
df.head()

In [ ]:
#from cleanco import basename

In [ ]:
#Apply basename function to each company name
for index, row in df.iterrows():
    df['Cleaned Name'][index] = basename(row['Original Company Name'])

In [ ]:
df.head()

In [ ]:
# saved_name = 'CleanedCompanyNames.xlsx'
# path =  f'C:/Users/aneave/OneDrive/Documents/Naming Conventions/Standardising Company Names/{saved_name}'
# df.to_excel(path,index=False)

In [11]:
#Read in saved cleaned names
saved_name = 'CleanedCompanyNames.xlsx'
path =  f'C:/Users/aneave/OneDrive/Documents/Naming Conventions/Standardising Company Names/{saved_name}'
df = pd.read_excel(path)

In [12]:
df.head()

        Original Company Name    Cleaned Name
0  @hand Software Corporation  @hand Software
1                    [24]7.ai        [24]7.ai
2                    [24]7.ai        [24]7.ai
3               1 Beekman LLC       1 Beekman
4               1 Beekman LLC       1 Beekman

## Clustering

In [13]:
company_names = df['Cleaned Name'].to_list()

In [14]:
vectorizer = TfidfVectorizer()
x = vectorizer.fit_transform(company_names)

In [15]:
clustering = AgglomerativeClustering(n_clusters=None, distance_threshold=0.3)
labels = clustering.fit_predict(x.toarray())

In [16]:
labels

array([6047, 2213, 2213, ...,    7,    7,    7], dtype=int64)

In [17]:
df['Cluster_labels']= labels

In [18]:
df.head()

        Original Company Name    Cleaned Name  Cluster_labels
0  @hand Software Corporation  @hand Software            6047
1                    [24]7.ai        [24]7.ai            2213
2                    [24]7.ai        [24]7.ai            2213
3               1 Beekman LLC       1 Beekman            2279
4               1 Beekman LLC       1 Beekman            2279

In [20]:
# saved_name = 'ClusteredCompanyNames.xlsx'
# path =  f'C:/Users/aneave/OneDrive/Documents/Naming Conventions/Standardising Company Names/{saved_name}'
# df.to_excel(path,index=False)

## Standardising Clusters

In [ ]:
#Load Saved Cluster Data
# saved_name = 'ClusteredCompanyNames.xlsx'
# path =  f'C:/Users/aneave/OneDrive/Documents/Naming Conventions/Standardising Company Names/{saved_name}'
# df = pd.read_excel(path)

In [21]:
# Define a function to propose the standardized name for each cluster
def propose_standardised_name(group):
    unique_values = group['Cleaned Name'].unique()
    if len(unique_values) == 1:
        return pd.DataFrame({'Proposed Standardised Name': [unique_values[0]]})
    else:
        return pd.DataFrame({'Proposed Standardised Name': ['']})

# Group the DataFrame by the 'Cluster Label' and propose standardized names for each cluster
proposed_names_df = df.groupby('Cluster_labels').apply(propose_standardised_name).reset_index(level=1, drop=True)
#Merge proposed names
df = df.merge(proposed_names_df, left_on='Cluster_labels', right_index=True)

In [22]:
#Visualise Results
for label in df['Cluster_labels'].unique():
    if len(df[df['Cluster_labels']==label]['Cleaned Name'].unique())>1:
        display(len(df[df['Cluster_labels']==label]['Cleaned Name'].unique()))
        grouping = df[df['Cluster_labels']==label]
        display(grouping)

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
90,800APP,800APP,2278,
91,800App,800App,2278,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
249,Actis Emerging Markets 3,Actis Emerging Markets 3,10,
7826,Net Curr (Actis Emerging Markets 3),Net Curr (Actis Emerging Markets 3),10,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
379,Advent V Carry Clawback,Advent V Carry Clawback,2970,
2044,Carry Clawback (Advent V B),Carry Clawback (Advent V B),2970,
2045,Carry Clawback (Advent V),Carry Clawback (Advent V),2970,
2046,Carry Clawback (Advent V),Carry Clawback (Advent V),2970,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
457,AirPlug,AirPlug,819,
458,Airplug,Airplug,819,
459,AirPlug Inc.,AirPlug,819,
460,AirPlug Inc.,AirPlug,819,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
530,AlfaLight Inc.,AlfaLight,2215,
531,AlfaLight Inc.,AlfaLight,2215,
532,AlfaLight Inc.,AlfaLight,2215,
533,"Alfalight, Inc",Alfalight,2215,
534,"Alfalight, Inc.",Alfalight,2215,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
690,Ameos Group,Ameos Group,6288,
691,AMEOS Group,AMEOS Group,6288,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
877,Applied Microstructures,Applied Microstructures,3572,
878,"Applied MicroStructures, Inc.",Applied MicroStructures,3572,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1010,Art.Com,Art.Com,3113,
1011,Art.com,Art.com,3113,
1012,Art.com,Art.com,3113,
1013,Art.com,Art.com,3113,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1097,Atmos Venture S.p.A. in liquidazione (A shares),Atmos Venture S.p.A. in liquidazione (A shares),2196,
1098,Atmos Venture S.p.A. in liquidazione (B shares),Atmos Venture S.p.A. in liquidazione (B shares),2196,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1301,"B. V. Capital Fund II, L.P.",B. V. Capital Fund II,4957,
1302,B.V.Capital Fund II,B.V.Capital Fund II,4957,
1303,B.V.Capital Fund II,B.V.Capital Fund II,4957,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1395,Beeb Ventures Ltd,Beeb Ventures,1519,
1396,beeb Ventures Ltd.,beeb Ventures,1519,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1414,BEMYEYE,BEMYEYE,2197,
1415,BeMyEye,BeMyEye,2197,
1416,BeMyEye,BeMyEye,2197,
1417,Bemyeye,Bemyeye,2197,
1418,BeMyEye,BeMyEye,2197,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1441,Best,Best,6441,
1442,Best,Best,6441,
1444,Best Inc,Best,6441,
1445,Best Inc.,Best,6441,
1446,BEST Inc.,BEST,6441,
1447,BEST Inc.,BEST,6441,
1448,BEST Inc.,BEST,6441,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1631,Bob's Discount Furniture,Bob's Discount Furniture,881,
1632,Bob's Discount Furniture,Bob's Discount Furniture,881,
1633,Bob's Discount Furniture,Bob's Discount Furniture,881,
1634,Bob's discount furniture,Bob's discount furniture,881,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1693,Brandalley,Brandalley,1108,
1694,Brandalley c/a,Brandalley c/a,1108,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1832,C & T Access Ventures Fund LLC,C & T Access Ventures Fund,3359,
1835,C&T Access Ventures Fund,C&T Access Ventures Fund,3359,
1836,C&T Access Ventures Fund,C&T Access Ventures Fund,3359,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1834,C&M Co.,C&M,2035,
6093,J&S,J&S,2035,
11810,Q Inc.,Q,2035,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
1925,Capital C,Capital C,3347,
1933,Capital Z,Capital Z,3347,
1934,Capital Z,Capital Z,3347,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2066,Carry Clawback (Bain VIII),Carry Clawback (Bain VIII),2905,
2067,Carry Clawback (Bain VIII),Carry Clawback (Bain VIII),2905,
2068,Carry Clawback (Bain VIII),Carry Clawback (Bain VIII),2905,
2069,Carry Clawback (Bain VIII-E),Carry Clawback (Bain VIII-E),2905,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2148,Carry clawback (MPM Bio III),Carry clawback (MPM Bio III),1870,
2149,Carry Clawback (MPM Bio III),Carry Clawback (MPM Bio III),1870,
2150,Carry Clawback (MPM Bio III),Carry Clawback (MPM Bio III),1870,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2186,Carry Clawback (Wicks C&M III),Carry Clawback (Wicks C&M III),2930,
2187,Carry Clawback (Wicks III),Carry Clawback (Wicks III),2930,
2188,Carry Clawback (Wicks III),Carry Clawback (Wicks III),2930,
2189,Carry Clawback (Wicks III),Carry Clawback (Wicks III),2930,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2222,Casestack,Casestack,402,
2223,"CaseStack, Inc.",CaseStack,402,
2224,"CaseStack, Inc.",CaseStack,402,
2225,"CaseStack, Inc.",CaseStack,402,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2246,Catalyst BioSciences,Catalyst BioSciences,902,
2247,Catalyst BioSciences,Catalyst BioSciences,902,
2248,Catalyst Biosciences,Catalyst Biosciences,902,
2249,Catalyst Biosciences,Catalyst Biosciences,902,
2250,Catalyst Biosciences,Catalyst Biosciences,902,
2251,Catalyst Biosciences,Catalyst Biosciences,902,
2252,"Catalyst Biosciences, Inc.",Catalyst Biosciences,902,
2253,"Catalyst Biosciences, Inc.",Catalyst Biosciences,902,
2254,"Catalyst Biosciences, Inc.",Catalyst Biosciences,902,
2255,"Catalyst Biosciences, Inc.",Catalyst Biosciences,902,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2273,CB Holdings,CB Holdings,3073,
2274,Cb Holdings,Cb Holdings,3073,
2275,CB Holdings,CB Holdings,3073,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2338,Cengage Learning (II),Cengage Learning (II),3186,
2339,Cengage Learning II,Cengage Learning II,3186,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2380,Cerberus Series Two,Cerberus Series Two,13,
8228,Net Curr (Cerberus Series Two),Net Curr (Cerberus Series Two),13,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2427,ChannelSoft Holdings,ChannelSoft Holdings,1881,
2428,Channelsoft Holdings Limited,Channelsoft Holdings,1881,
2429,Channelsoft Holdings Limited,Channelsoft Holdings,1881,
2430,Channelsoft Holdings Limited,Channelsoft Holdings,1881,
2431,Channelsoft Holdings Limited,Channelsoft Holdings,1881,
2432,Channelsoft Holdings Limited,Channelsoft Holdings,1881,
2433,Channelsoft Holdings Limited,Channelsoft Holdings,1881,
2434,Channelsoft Holdings Limited,Channelsoft Holdings,1881,
2435,Channelsoft Holdings Limited,Channelsoft Holdings,1881,
2436,Channelsoft Holdings Limited,Channelsoft Holdings,1881,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2725,Common stock,Common stock,1786,
2726,Common Stock,Common Stock,1786,
2727,Common Stock,Common Stock,1786,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2766,ComQi,ComQi,273,
2767,ComQI,ComQI,273,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2783,Concardis / Nets,Concardis / Nets,430,
10255,Nets/Concardis,Nets/Concardis,430,
10256,Nets/Concardis,Nets/Concardis,430,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
2838,Convertible Note (Newco B),Convertible Note (Newco B),420,
10379,Newco B (Convertible note),Newco B (Convertible note),420,
10380,Newco B (Convertible note),Newco B (Convertible note),420,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
3576,Eat Just,Eat Just,1772,
6222,Just Eat,Just Eat,1772,
6223,Just Eat,Just Eat,1772,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
3622,eDreams OdigeO,eDreams OdigeO,1115,
3623,eDreams OdigeO,eDreams OdigeO,1115,
3624,eDreams Odigeo,eDreams Odigeo,1115,
3625,eDreams OdigeO,eDreams OdigeO,1115,
3626,eDreams OdigeO,eDreams OdigeO,1115,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
3668,eharmony,eharmony,168,
3669,eharmony,eharmony,168,
3670,eharmony,eharmony,168,
3671,eharmony,eharmony,168,
3672,eharmony,eharmony,168,
3673,eharmony,eharmony,168,
3674,eHarmony,eHarmony,168,
3675,eHarmony,eHarmony,168,
3676,"eHarmony, Inc.",eHarmony,168,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
3682,Eiger Biopharmaceuticals,Eiger Biopharmaceuticals,706,
3683,Eiger Biopharmaceuticals Inc.,Eiger Biopharmaceuticals,706,
3684,"Eiger Biopharmaceuticals, Inc.",Eiger Biopharmaceuticals,706,
3685,"Eiger BioPharmaceuticals, Inc.",Eiger BioPharmaceuticals,706,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
3764,Emerging Europe Growth Fund II LP,Emerging Europe Growth Fund II,2,
3765,Emerging Europe Growth Fund LP,Emerging Europe Growth Fund,2,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
3867,Entomo 1 Inc,Entomo 1,2158,
3868,Entomo 2 Inc,Entomo 2,2158,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
3957,Escrow Receivable (New Mountain ii (A)),Escrow Receivable (New Mountain ii (A)),7061,
3958,Escrow Receivable (New Mountain II),Escrow Receivable (New Mountain II),7061,
3959,Escrow Receivable (New Mountain II),Escrow Receivable (New Mountain II),7061,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
3969,Escrows (Act 99 ( C)),Escrows (Act 99 ( C)),1897,
3970,Escrows (Act 99 (B)),Escrows (Act 99 (B)),1897,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
3998,Essex Woodlands VII,Essex Woodlands VII,4,
8455,Net Curr (Essex Woodlands VII),Net Curr (Essex Woodlands VII),4,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4080,EWOS / Nova Austral,EWOS / Nova Austral,3239,
4081,EWOS / Nova Austral,EWOS / Nova Austral,3239,
4082,EWOS / Nova Austral,EWOS / Nova Austral,3239,
4083,EWOS/Nova Austral,EWOS/Nova Austral,3239,
4084,EWOS/Nova Austral,EWOS/Nova Austral,3239,
4085,EWOS/Nova Austral,EWOS/Nova Austral,3239,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4196,FarFetch,FarFetch,311,
4197,Farfetch,Farfetch,311,
4198,Farfetch,Farfetch,311,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4204,Fate Therapeutics,Fate Therapeutics,4950,
4205,Fate Therapeutics,Fate Therapeutics,4950,
4206,FATE Therapeutics,FATE Therapeutics,4950,
4207,Fate Therapeutics,Fate Therapeutics,4950,
4208,Fate Therapeutics,Fate Therapeutics,4950,
4209,Fate Therapeutics,Fate Therapeutics,4950,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4361,FlipBoard,FlipBoard,1246,
4362,Flipboard,Flipboard,1246,
4363,"Flipboard, Inc.",Flipboard,1246,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4408,ForeScout Technologies,ForeScout Technologies,4016,
4409,ForeScout Technologies,ForeScout Technologies,4016,
4410,Forescout Technologies,Forescout Technologies,4016,
4411,Forescout Technologies,Forescout Technologies,4016,
4412,Forescout Technologies,Forescout Technologies,4016,
4413,Forescout Technologies,Forescout Technologies,4016,
4414,Forescout Technologies,Forescout Technologies,4016,
4415,Forescout Technologies Inc,Forescout Technologies,4016,
4416,Forescout Technologies Inc.,Forescout Technologies,4016,
4417,Forescout Technologies Inc.,Forescout Technologies,4016,
4418,Forescout Technologies Inc.,Forescout Technologies,4016,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4521,Fronton Investor Holdings,Fronton Investor Holdings,1392,
4522,Fronton Investor Holdings. LLC,Fronton Investor Holdings.,1392,
4523,Fronton Investor Holdings. LLC,Fronton Investor Holdings.,1392,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4564,Fuse Media,Fuse Media,3409,
4565,Fuse Media Inc,Fuse Media,3409,
4566,"Fuse Media, Inc.",Fuse Media,3409,
4567,"Fuse Media, Inc.",Fuse Media,3409,
4568,FUSE+Media,FUSE+Media,3409,
4569,FUSE+Media Private,FUSE+Media,3409,
4570,FUSE+Media Private,FUSE+Media,3409,
4571,FUSE+Media Private Ltd.,FUSE+Media,3409,
4572,FUSE+Media Private Ltd.,FUSE+Media,3409,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4641,GenBand,GenBand,1887,
4642,Genband,Genband,1887,
4643,GenBand,GenBand,1887,
4644,Genband,Genband,1887,
4649,"Genband, Inc.",Genband,1887,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4818,Glysure,Glysure,533,
4819,GlySure,GlySure,533,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4926,GreenRoad,GreenRoad,329,
4927,Greenroad,Greenroad,329,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
4971,GSR Partners I and GSR Ventures I,GSR Partners I and GSR Ventures I,2583,
4972,GSR Partners I and GSR Ventures I,GSR Partners I and GSR Ventures I,2583,
4973,GSR Partners I and GSR Ventures I,GSR Partners I and GSR Ventures I,2583,
4974,"GSR Partners I, L.P. and GSR Ventures I, L.P.","GSR Partners I, L.P. and GSR Ventures I",2583,
4975,"GSR Partners I, L.P. and GSR Ventures I, L.P.","GSR Partners I, L.P. and GSR Ventures I",2583,
4976,"GSR Partners I, L.P. and GSR Ventures I, LP.","GSR Partners I, L.P. and GSR Ventures I",2583,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5009,Gxs,Gxs,197,
5010,GXS,GXS,197,
5011,GXS,GXS,197,
5012,GXS,GXS,197,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5180,Hexatech,Hexatech,538,
5181,HexaTech,HexaTech,538,
5182,HexaTech,HexaTech,538,
5183,HexaTech,HexaTech,538,
5184,HexaTech,HexaTech,538,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5214,Highland Consumer Fund,Highland Consumer Fund,1642,
5215,Highland Consumer Fund,Highland Consumer Fund,1642,
5216,Highland Consumer Fund I/I-B L.P.,Highland Consumer Fund I/I-B,1642,
5217,Highland Consumer Fund I/I-B L.P.,Highland Consumer Fund I/I-B,1642,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5225,HighTail,HighTail,887,
5226,Hightail,Hightail,887,
5227,Hightail,Hightail,887,
5228,Hightail,Hightail,887,
5229,Hightail,Hightail,887,
5230,Hightail,Hightail,887,
5231,Hightail,Hightail,887,
5232,Hightail,Hightail,887,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5326,Hony Capital Fund 2008,Hony Capital Fund 2008,6,
8681,Net Curr (Hony Capital Fund 2008),Net Curr (Hony Capital Fund 2008),6,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5327,HOOKIPA Biotech,HOOKIPA Biotech,1470,
5328,Hookipa Biotech,Hookipa Biotech,1470,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5441,Hubpages,Hubpages,306,
5442,HubPages,HubPages,306,
5443,HubPages,HubPages,306,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5468,Hydra Biosciences,Hydra Biosciences,1487,
5469,Hydra Biosciences,Hydra Biosciences,1487,
5470,Hydra Biosciences,Hydra Biosciences,1487,
5471,Hydra Biosciences,Hydra Biosciences,1487,
5472,Hydra Biosciences,Hydra Biosciences,1487,
5473,Hydra Biosciences,Hydra Biosciences,1487,
5474,Hydra Biosciences,Hydra Biosciences,1487,
5475,Hydra Biosciences,Hydra Biosciences,1487,
5476,Hydra Biosciences,Hydra Biosciences,1487,
5477,Hydra Biosciences,Hydra Biosciences,1487,
5478,Hydra Biosciences,Hydra Biosciences,1487,
5479,Hydra Biosciences,Hydra Biosciences,1487,
5480,Hydra Biosciences,Hydra Biosciences,1487,
5481,Hydra Biosciences,Hydra Biosciences,1487,
5482,Hydra BioSciences,Hydra BioSciences,1487,
5483,Hydra BioSciences,Hydra BioSciences,1487,
5484,"Hydra Biosciences, Inc.",Hydra Biosciences,1487,
5485,"Hydra Biosciences, Inc.",Hydra Biosciences,1487,
5486,"Hydra Biosciences, Inc.",Hydra Biosciences,1487,
5487,"Hydra Biosciences, Inc.",Hydra Biosciences,1487,
5488,"Hydra Biosciences, Inc.",Hydra Biosciences,1487,
5489,"Hydra Biosciences, Inc.",Hydra Biosciences,1487,
5490,"Hydra Biosciences, Inc.",Hydra Biosciences,1487,
5491,"Hydra Biosciences, Inc.",Hydra Biosciences,1487,
5492,"Hydra BioSciences, Inc.",Hydra BioSciences,1487,
5493,"Hydra BioSciences, Inc.",Hydra BioSciences,1487,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5531,Idea,Idea,318,
5532,IDEA AG,IDEA,318,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5563,iGate,iGate,612,
5564,iGATE,iGATE,612,
5565,iGATE,iGATE,612,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5685,"Industri Kapital 2000, L.P.",Industri Kapital 2000,21,
8724,Net Curr (Industri Kapital 2000),Net Curr (Industri Kapital 2000),21,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5692,InfiLaw,InfiLaw,524,
5693,Infilaw,Infilaw,524,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5905,InterWest Investors Q VIII,InterWest Investors Q VIII,722,
5906,InterWest Investors VIII,InterWest Investors VIII,722,

9

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5963,Investment 1,Investment 1,3427,
5974,Investment 2,Investment 2,3427,
5977,Investment 3,Investment 3,3427,
5978,Investment 4,Investment 4,3427,
5979,Investment 5,Investment 5,3427,
5980,Investment 6,Investment 6,3427,
5981,Investment 7,Investment 7,3427,
5982,Investment 8,Investment 8,3427,
5983,Investment 9,Investment 9,3427,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
5992,Investments (Bencis III (A)),Investments (Bencis III (A)),2770,
5993,Investments (Bencis III (B)),Investments (Bencis III (B)),2770,
5994,Investments (Bencis III (C)),Investments (Bencis III (C)),2770,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
6022,IP Access,IP Access,2725,
6023,ip.access,ip.access,2725,
6024,Ip.access,Ip.access,2725,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
6241,K Alpha SA,K Alpha,1491,
6242,K Alpha SA,K Alpha,1491,
6243,K Alpha SA,K Alpha,1491,
6244,K Alpha SA,K Alpha,1491,
6245,K Alpha SA,K Alpha,1491,
15489,Z Alpha SA,Z Alpha,1491,
15490,Z Alpha SA,Z Alpha,1491,
15491,Z Alpha SA,Z Alpha,1491,
15492,Z Alpha SA,Z Alpha,1491,
15493,Z Alpha SA,Z Alpha,1491,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
6268,KalVista Pharmaceuticals,KalVista Pharmaceuticals,1789,
6269,KalVista Pharmaceuticals,KalVista Pharmaceuticals,1789,
6270,KalVista Pharmaceuticals,KalVista Pharmaceuticals,1789,
6271,KalVista Pharmaceuticals,KalVista Pharmaceuticals,1789,
6272,"Kalvista Pharmaceuticals, Inc",Kalvista Pharmaceuticals,1789,
6273,"KalVista Pharmaceuticals, Inc.",KalVista Pharmaceuticals,1789,
6274,"Kalvista Pharmaceuticals, Inc.",Kalvista Pharmaceuticals,1789,
6275,"Kalvista Pharmaceuticals, Inc.",Kalvista Pharmaceuticals,1789,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
6563,Ldl Technology,Ldl Technology,2982,
6564,LDL Technology,LDL Technology,2982,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
6676,Lineagen,Lineagen,302,
6677,"LineaGen, Inc.",LineaGen,302,
6678,"LineaGen, Inc.",LineaGen,302,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
6748,"LN Holdings, Inc (Liquidnet)","LN Holdings, Inc (Liquidnet)",2529,
6749,"LN Holdings, Inc. (Liquidnet)","LN Holdings, Inc. (Liquidnet)",2529,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7155,MedVantx,MedVantx,778,
7156,"Medvantx, Inc.",Medvantx,778,
7157,"Medvantx, Inc.",Medvantx,778,
7158,"Medvantx, Inc.",Medvantx,778,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7173,Megapath,Megapath,300,
7174,MegaPath,MegaPath,300,
7175,MegaPath,MegaPath,300,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7385,MIPs,MIPs,530,
7386,MIPs,MIPs,530,
7387,MIPS AB,MIPS,530,
7388,MIPS AB,MIPS,530,
7389,MIPS AB,MIPS,530,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7479,Monitor Ventures A,Monitor Ventures A,3160,
7480,Monitor Ventures I-A,Monitor Ventures I-A,3160,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7563,MuleSoft,MuleSoft,1017,
7564,Mulesoft,Mulesoft,1017,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7580,Mustang Ventures,Mustang Ventures,437,
7581,Mustang Ventures I,Mustang Ventures I,437,
7582,Mustang Ventures I,Mustang Ventures I,437,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7688,Navix Holdings Corporation,Navix Holdings,2011,
7689,NAVIX Holdings Corporation,NAVIX Holdings,2011,
7690,NAVIX Holdings Corporation,NAVIX Holdings,2011,
7691,NAVIX Holdings Corporation,NAVIX Holdings,2011,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7735,Neotract,Neotract,2974,
7736,Neotract,Neotract,2974,
7737,NeoTract,NeoTract,2974,
7738,NeoTract,NeoTract,2974,
7739,NeoTract,NeoTract,2974,
7740,NeoTract,NeoTract,2974,
7741,NeoTract,NeoTract,2974,
7742,NeoTract,NeoTract,2974,
7743,NeoTract,NeoTract,2974,
7744,NeoTract,NeoTract,2974,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7759,Net Curr (360 Capital One (A)),Net Curr (360 Capital One (A)),3281,
7760,Net Curr (360 Capital One (B)),Net Curr (360 Capital One (B)),3281,
7761,Net Curr (360 Capital One (C)),Net Curr (360 Capital One (C)),3281,
7762,Net Curr (360 Capital One),Net Curr (360 Capital One),3281,
7763,Net Curr (360 Capital One),Net Curr (360 Capital One),3281,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7775,Net Curr (Abingworth V (A)),Net Curr (Abingworth V (A)),3069,
7776,Net Curr (Abingworth V (A)),Net Curr (Abingworth V (A)),3069,
7777,Net Curr (Abingworth V (B)),Net Curr (Abingworth V (B)),3069,
7778,Net Curr (Abingworth V (B)),Net Curr (Abingworth V (B)),3069,
7779,Net Curr (Abingworth V (C)),Net Curr (Abingworth V (C)),3069,
7782,Net Curr (Abingworth V),Net Curr (Abingworth V),3069,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7786,Net Curr (ABRY Mezzanine Partners (A)),Net Curr (ABRY Mezzanine Partners (A)),2415,
7787,Net Curr (ABRY Mezzanine Partners (B)),Net Curr (ABRY Mezzanine Partners (B)),2415,
7788,Net Curr (ABRY Mezzanine Partners (C)),Net Curr (ABRY Mezzanine Partners (C)),2415,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7790,Net Curr (ABRY Senior II (A)),Net Curr (ABRY Senior II (A)),3265,
7791,Net Curr (ABRY Senior II (B)),Net Curr (ABRY Senior II (B)),3265,
7792,Net Curr (ABRY Senior II (C)),Net Curr (ABRY Senior II (C)),3265,
7793,Net Curr (ABRY Senior II (D)),Net Curr (ABRY Senior II (D)),3265,
7794,Net Curr (ABRY Senior II (E)),Net Curr (ABRY Senior II (E)),3265,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7796,Net Curr (ABRY V (A)),Net Curr (ABRY V (A)),717,
7797,Net Curr (ABRY V (A)),Net Curr (ABRY V (A)),717,
7798,Net Curr (ABRY V (B)),Net Curr (ABRY V (B)),717,
7799,Net Curr (ABRY V (B)),Net Curr (ABRY V (B)),717,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7804,Net Curr (Accel Europe (A)),Net Curr (Accel Europe (A)),2677,
7805,Net Curr (Accel Europe (B)),Net Curr (Accel Europe (B)),2677,
7806,Net Curr (Accel Europe (C)),Net Curr (Accel Europe (C)),2677,
7807,Net Curr (Accel Europe (D)),Net Curr (Accel Europe (D)),2677,
7808,Net Curr (Accel Europe),Net Curr (Accel Europe),2677,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7814,Net Curr (Accel London II (A)),Net Curr (Accel London II (A)),1986,
7815,Net Curr (Accel London II (B)),Net Curr (Accel London II (B)),1986,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7820,Net Curr (Accent Equity 2008 (A)),Net Curr (Accent Equity 2008 (A)),1357,
7821,Net Curr (Accent Equity 2008 (B)),Net Curr (Accent Equity 2008 (B)),1357,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7830,Net Curr (Adams III (A)),Net Curr (Adams III (A)),3518,
7831,Net Curr (Adams III (B)),Net Curr (Adams III (B)),3518,

6

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7833,Net Curr (Advent 5),Net Curr (Advent 5),1352,
7837,Net Curr (Advent V (A)),Net Curr (Advent V (A)),1352,
7838,Net Curr (Advent V (A)),Net Curr (Advent V (A)),1352,
7839,Net Curr (Advent V (B)),Net Curr (Advent V (B)),1352,
7840,Net Curr (Advent V (B)),Net Curr (Advent V (B)),1352,
7841,Net Curr (Advent V (C)),Net Curr (Advent V (C)),1352,
7842,Net Curr (Advent V (C)),Net Curr (Advent V (C)),1352,
7843,Net Curr (Advent V (D)),Net Curr (Advent V (D)),1352,
7844,Net Curr (Advent V (E)),Net Curr (Advent V (E)),1352,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7834,Net Curr (Advent IV (A)),Net Curr (Advent IV (A)),1245,
7835,Net Curr (Advent IV (B)),Net Curr (Advent IV (B)),1245,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7846,Net Curr (Advent VI (A)),Net Curr (Advent VI (A)),3462,
7847,Net Curr (Advent VI (B)),Net Curr (Advent VI (B)),3462,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7856,Net Curr (AIG Real Estate II),Net Curr (AIG Real Estate II),3,
7857,Net Curr (AIG Real Estate X),Net Curr (AIG Real Estate X),3,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7859,Net Curr (Aksia III (A)),Net Curr (Aksia III (A)),2734,
7860,Net Curr (Aksia III (B)),Net Curr (Aksia III (B)),2734,
7861,Net Curr (Aksia III),Net Curr (Aksia III),2734,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7875,Net Curr (Alpha PE 5 (A)),Net Curr (Alpha PE 5 (A)),3033,
7876,Net Curr (Alpha PE 5 (B)),Net Curr (Alpha PE 5 (B)),3033,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7877,Net Curr (Alta Communications IX (A)),Net Curr (Alta Communications IX (A)),1360,
7878,Net Curr (Alta Communications IX (B)),Net Curr (Alta Communications IX (B)),1360,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7882,Net Curr (Alto II (A)),Net Curr (Alto II (A)),7079,
7883,Net Curr (Alto II (B)),Net Curr (Alto II (B)),7079,
7884,Net Curr (Alto II),Net Curr (Alto II),7079,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7886,Net Curr (Altor II (A)),Net Curr (Altor II (A)),2073,
7887,Net Curr (Altor II (B)),Net Curr (Altor II (B)),2073,
7888,Net Curr (Altor II),Net Curr (Altor II),2073,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7892,Net Curr (Amadeus II (A)),Net Curr (Amadeus II (A)),2637,
7893,Net Curr (Amadeus II (B)),Net Curr (Amadeus II (B)),2637,
7894,Net Curr (Amadeus II),Net Curr (Amadeus II),2637,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7895,Net Curr (Amadeus III (A)),Net Curr (Amadeus III (A)),3600,
7896,Net Curr (Amadeus III (B)),Net Curr (Amadeus III (B)),3600,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7898,Net Curr (American Capital Equity II (A)),Net Curr (American Capital Equity II (A)),3192,
7899,Net Curr (American Capital Equity II (B)),Net Curr (American Capital Equity II (B)),3192,
7900,Net Curr (American Capital Equity II),Net Curr (American Capital Equity II),3192,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7904,Net Curr (Apax Europe VII - B),Net Curr (Apax Europe VII - B),3703,
7905,Net Curr (Apax Europe VII (A)),Net Curr (Apax Europe VII (A)),3703,
7906,Net Curr (Apax Europe VII (B)),Net Curr (Apax Europe VII (B)),3703,
7907,Net Curr (Apax Europe VII (C)),Net Curr (Apax Europe VII (C)),3703,
7911,Net Curr (Apax Europe VII),Net Curr (Apax Europe VII),3703,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7909,Net Curr (Apax Europe VII Side Car - 2),Net Curr (Apax Europe VII Side Car - 2),4939,
7910,Net Curr (Apax Europe VII Side Car),Net Curr (Apax Europe VII Side Car),4939,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7913,Net Curr (Apax US VII (A)),Net Curr (Apax US VII (A)),1678,
7914,Net Curr (Apax US VII (B)),Net Curr (Apax US VII (B)),1678,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7915,Net Curr (Apax V (A)),Net Curr (Apax V (A)),835,
7916,Net Curr (Apax V (B)),Net Curr (Apax V (B)),835,

8

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7917,Net Curr (Apax VI (A)),Net Curr (Apax VI (A)),4944,
7918,Net Curr (Apax VI (A)),Net Curr (Apax VI (A)),4944,
7919,Net Curr (Apax VI (B)),Net Curr (Apax VI (B)),4944,
7920,Net Curr (Apax VI (B)),Net Curr (Apax VI (B)),4944,
7921,Net Curr (Apax VI (C)),Net Curr (Apax VI (C)),4944,
7922,Net Curr (Apax VI (D)),Net Curr (Apax VI (D)),4944,
7923,Net Curr (Apax VI (E)),Net Curr (Apax VI (E)),4944,
7924,Net Curr (Apax VI (F)),Net Curr (Apax VI (F)),4944,
7925,Net Curr (Apax VI),Net Curr (Apax VI),4944,
7926,Net Curr (Apax VI-A),Net Curr (Apax VI-A),4944,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7930,Net Curr (Apollo VI (A)),Net Curr (Apollo VI (A)),5018,
7931,Net Curr (Apollo VI (A)),Net Curr (Apollo VI (A)),5018,
7932,Net Curr (Apollo VI (B)),Net Curr (Apollo VI (B)),5018,
7933,Net Curr (Apollo VI (B)),Net Curr (Apollo VI (B)),5018,
7934,Net Curr (Apollo VI (C)),Net Curr (Apollo VI (C)),5018,
7935,Net Curr (Apollo VI (D)),Net Curr (Apollo VI (D)),5018,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7937,Net Curr (Arcadia (A)),Net Curr (Arcadia (A)),1743,
7938,Net Curr (Arcadia (B)),Net Curr (Arcadia (B)),1743,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7939,Net Curr (Arcadia II (A)),Net Curr (Arcadia II (A)),4097,
7940,Net Curr (Arcadia II (B)),Net Curr (Arcadia II (B)),4097,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7942,Net Curr (ARCH VI),Net Curr (ARCH VI),3755,
7943,Net Curr (Arch VI),Net Curr (Arch VI),3755,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7950,Net Curr (Argan (A)),Net Curr (Argan (A)),2459,
7951,Net Curr (Argan (A)),Net Curr (Argan (A)),2459,
7952,Net Curr (Argan (B)),Net Curr (Argan (B)),2459,
7953,Net Curr (Argan (B)),Net Curr (Argan (B)),2459,
7954,Net Curr (Argan (C)),Net Curr (Argan (C)),2459,
7955,Net Curr (Argan (D)),Net Curr (Argan (D)),2459,
7956,Net Curr (Argan (E)),Net Curr (Argan (E)),2459,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7957,Net Curr (Argo II (A)),Net Curr (Argo II (A)),2810,
7958,Net Curr (Argo II (A)),Net Curr (Argo II (A)),2810,
7959,Net Curr (Argo II (B)),Net Curr (Argo II (B)),2810,
7960,Net Curr (Argo II (B)),Net Curr (Argo II (B)),2810,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7962,Net Curr (Artiman (A)),Net Curr (Artiman (A)),3094,
7963,Net Curr (Artiman (B)),Net Curr (Artiman (B)),3094,
7964,Net Curr (Artiman),Net Curr (Artiman),3094,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7968,Net Curr (Asia Pacific III (A)),Net Curr (Asia Pacific III (A)),3445,
7969,Net Curr (Asia Pacific III (B)),Net Curr (Asia Pacific III (B)),3445,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7976,Net Curr (Atlas VI (A)),Net Curr (Atlas VI (A)),4105,
7977,Net Curr (Atlas VI (B)),Net Curr (Atlas VI (B)),4105,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7982,Net Curr (Audax (A)),Net Curr (Audax (A)),2760,
7983,Net Curr (Audax (B)),Net Curr (Audax (B)),2760,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7990,Net Curr (August Capital IV (A)),Net Curr (August Capital IV (A)),1504,
7991,Net Curr (August Capital IV (B)),Net Curr (August Capital IV (B)),1504,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
7992,Net Curr (August II A),Net Curr (August II A),2528,
7993,Net Curr (August II),Net Curr (August II),2528,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8000,Net Curr (Austin VIII (A)),Net Curr (Austin VIII (A)),3234,
8001,Net Curr (Austin VIII (B)),Net Curr (Austin VIII (B)),3234,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8004,Net Curr (Avista (A)),Net Curr (Avista (A)),1977,
8005,Net Curr (Avista (B)),Net Curr (Avista (B)),1977,
8006,Net Curr (Avista),Net Curr (Avista),1977,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8014,Net Curr (Bain Europe III (A)),Net Curr (Bain Europe III (A)),3371,
8015,Net Curr (Bain Europe III (B)),Net Curr (Bain Europe III (B)),3371,
8016,Net Curr (Bain Europe III (C)),Net Curr (Bain Europe III (C)),3371,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8017,Net Curr (Bain III (A)),Net Curr (Bain III (A)),931,
8018,Net Curr (Bain III (B)),Net Curr (Bain III (B)),931,
8019,Net Curr (Bain III (C)),Net Curr (Bain III (C)),931,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8020,Net Curr (Bain IX (A)),Net Curr (Bain IX (A)),1355,
8021,Net Curr (Bain IX (B)),Net Curr (Bain IX (B)),1355,
8022,Net Curr (Bain IX (C)),Net Curr (Bain IX (C)),1355,
8023,Net Curr (Bain IX (D)),Net Curr (Bain IX (D)),1355,
8025,Net Curr (Bain IX),Net Curr (Bain IX),1355,

6

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8030,Net Curr (Bain VIII),Net Curr (Bain VIII),676,
8031,Net Curr (Bain VIII),Net Curr (Bain VIII),676,
8032,Net Curr (Bain VIII),Net Curr (Bain VIII),676,
8033,Net Curr (Bain VIII-E (A)),Net Curr (Bain VIII-E (A)),676,
8034,Net Curr (Bain VIII-E (B)),Net Curr (Bain VIII-E (B)),676,
8035,Net Curr (Bain VIII-E (C)),Net Curr (Bain VIII-E (C)),676,
8036,Net Curr (Bain VIII-E (D)),Net Curr (Bain VIII-E (D)),676,
8037,Net Curr (Bain VIII-E),Net Curr (Bain VIII-E),676,
8038,Net Curr (Bain VIII-E),Net Curr (Bain VIII-E),676,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8039,Net Curr (Bain X (A)),Net Curr (Bain X (A)),824,
8040,Net Curr (Bain X (B)),Net Curr (Bain X (B)),824,
8041,Net Curr (Bain X),Net Curr (Bain X),824,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8042,Net Curr (Baker II (A)),Net Curr (Baker II (A)),7056,
8043,Net Curr (Baker II (A)),Net Curr (Baker II (A)),7056,
8044,Net Curr (Baker II (B)),Net Curr (Baker II (B)),7056,
8045,Net Curr (Baker II (B)),Net Curr (Baker II (B)),7056,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8047,Net Curr (Balderton I (A)),Net Curr (Balderton I (A)),3628,
8048,Net Curr (Balderton I (B)),Net Curr (Balderton I (B)),3628,
8049,Net Curr (Balderton I (C)),Net Curr (Balderton I (C)),3628,
8050,Net Curr (Balderton I),Net Curr (Balderton I),3628,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8061,Net Curr (Baring Vostok IV (A)),Net Curr (Baring Vostok IV (A)),2994,
8062,Net Curr (Baring Vostok IV (B)),Net Curr (Baring Vostok IV (B)),2994,
8063,Net Curr (Baring Vostok IV (C)),Net Curr (Baring Vostok IV (C)),2994,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8064,Net Curr (Baring Vostok IV Supp. (A)),Net Curr (Baring Vostok IV Supp. (A)),1664,
8065,Net Curr (Baring Vostok IV Supp. (B)),Net Curr (Baring Vostok IV Supp. (B)),1664,
8066,Net Curr (Baring Vostok IV Supp. (C)),Net Curr (Baring Vostok IV Supp. (C)),1664,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8067,Net Curr (Battery VII (A)),Net Curr (Battery VII (A)),760,
8068,Net Curr (Battery VII (B)),Net Curr (Battery VII (B)),760,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8077,Net Curr (BC European VII (A)),Net Curr (BC European VII (A)),1457,
8078,Net Curr (BC European VII (B)),Net Curr (BC European VII (B)),1457,
8081,Net Curr (BC European VII),Net Curr (BC European VII),1457,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8079,Net Curr (BC European VII Top Up),Net Curr (BC European VII Top Up),1481,
8080,Net Curr (BC European VII Top-Up),Net Curr (BC European VII Top-Up),1481,

7

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8082,Net Curr (BC European VIII (A)),Net Curr (BC European VIII (A)),6555,
8083,Net Curr (BC European VIII (A)),Net Curr (BC European VIII (A)),6555,
8084,Net Curr (BC European VIII (B)),Net Curr (BC European VIII (B)),6555,
8085,Net Curr (BC European VIII (B)),Net Curr (BC European VIII (B)),6555,
8086,Net Curr (BC European VIII (C)),Net Curr (BC European VIII (C)),6555,
8087,Net Curr (BC European VIII (D)),Net Curr (BC European VIII (D)),6555,
8088,Net Curr (BC European VIII (E)),Net Curr (BC European VIII (E)),6555,
8089,Net Curr (BC European VIII (F)),Net Curr (BC European VIII (F)),6555,
8090,Net Curr (BC European VIII),Net Curr (BC European VIII),6555,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8096,Net Curr (Benchmark Israel II (A)),Net Curr (Benchmark Israel II (A)),827,
8097,Net Curr (Benchmark Israel II (B)),Net Curr (Benchmark Israel II (B)),827,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8098,Net Curr (Benchmark V (A)),Net Curr (Benchmark V (A)),1473,
8099,Net Curr (Benchmark V (B)),Net Curr (Benchmark V (B)),1473,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8100,Net Curr (Bencis III (A)),Net Curr (Bencis III (A)),3308,
8101,Net Curr (Bencis III (B)),Net Curr (Bencis III (B)),3308,
8102,Net Curr (Bencis III (C)),Net Curr (Bencis III (C)),3308,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8104,Net Curr (Berkshire VII (A)),Net Curr (Berkshire VII (A)),1613,
8105,Net Curr (Berkshire VII (B)),Net Curr (Berkshire VII (B)),1613,
8106,Net Curr (Berkshire VII),Net Curr (Berkshire VII),1613,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8108,Net Curr (Blackstone Comm (A)),Net Curr (Blackstone Comm (A)),1882,
8109,Net Curr (Blackstone Comm (B)),Net Curr (Blackstone Comm (B)),1882,
8110,Net Curr (Blackstone Comm (C)),Net Curr (Blackstone Comm (C)),1882,

6

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8112,Net Curr (Blackstone V (A)),Net Curr (Blackstone V (A)),3482,
8113,Net Curr (Blackstone V (B)),Net Curr (Blackstone V (B)),3482,
8114,Net Curr (Blackstone V (C)),Net Curr (Blackstone V (C)),3482,
8115,Net Curr (Blackstone V (D)),Net Curr (Blackstone V (D)),3482,
8116,Net Curr (Blackstone V (E)),Net Curr (Blackstone V (E)),3482,
8117,Net Curr (Blackstone V),Net Curr (Blackstone V),3482,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8120,Net Curr (BMP I),Net Curr (BMP I),2514,
8122,Net Curr (BMP),Net Curr (BMP),2514,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8128,Net Curr (Brentwood IV (A)),Net Curr (Brentwood IV (A)),5158,
8129,Net Curr (Brentwood IV (B)),Net Curr (Brentwood IV (B)),5158,
8130,Net Curr (Brentwood IV),Net Curr (Brentwood IV),5158,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8141,Net Curr (Brockway Moran III (A)),Net Curr (Brockway Moran III (A)),1829,
8142,Net Curr (Brockway Moran III (B)),Net Curr (Brockway Moran III (B)),1829,
8143,Net Curr (Brockway Moran III),Net Curr (Brockway Moran III),1829,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8157,Net Curr (Capiton IV (A)),Net Curr (Capiton IV (A)),2510,
8158,Net Curr (Capiton IV (B)),Net Curr (Capiton IV (B)),2510,
8159,Net Curr (Capiton IV (C)),Net Curr (Capiton IV (C)),2510,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8164,Net Curr (Capvis III (A)),Net Curr (Capvis III (A)),1852,
8165,Net Curr (Capvis III (B)),Net Curr (Capvis III (B)),1852,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8172,Net Curr (Carlyle Europe II (A)),Net Curr (Carlyle Europe II (A)),3006,
8173,Net Curr (Carlyle Europe II (B)),Net Curr (Carlyle Europe II (B)),3006,
8174,Net Curr (Carlyle Europe II),Net Curr (Carlyle Europe II),3006,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8189,Net Curr (Castle Harlan IV (A)),Net Curr (Castle Harlan IV (A)),960,
8190,Net Curr (Castle Harlan IV (B)),Net Curr (Castle Harlan IV (B)),960,
8191,Net Curr (Castle Harlan IV),Net Curr (Castle Harlan IV),960,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8192,Net Curr (Catalyst 2),Net Curr (Catalyst 2),1773,
8193,Net Curr (Catalyst I),Net Curr (Catalyst I),1773,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8201,Net Curr (CD&R VI (A)),Net Curr (CD&R VI (A)),2927,
8202,Net Curr (CD&R VI (B)),Net Curr (CD&R VI (B)),2927,
8203,Net Curr (CD&R VI),Net Curr (CD&R VI),2927,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8205,Net Curr (CDH China III (A)),Net Curr (CDH China III (A)),1432,
8206,Net Curr (CDH China III (B)),Net Curr (CDH China III (B)),1432,
8207,Net Curr (CDH China III (C)),Net Curr (CDH China III (C)),1432,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8208,Net Curr (CDH China III Feeder (A)),Net Curr (CDH China III Feeder (A)),3387,
8209,Net Curr (CDH China III Feeder (B)),Net Curr (CDH China III Feeder (B)),3387,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8211,Net Curr (CDH Supp III (A)),Net Curr (CDH Supp III (A)),3562,
8212,Net Curr (CDH Supp III (B)),Net Curr (CDH Supp III (B)),3562,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8216,Net Curr (Centerbridge (A)),Net Curr (Centerbridge (A)),462,
8217,Net Curr (Centerbridge (B)),Net Curr (Centerbridge (B)),462,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8220,Net Curr (Cerberus Series 1 (A)),Net Curr (Cerberus Series 1 (A)),3357,
8221,Net Curr (Cerberus Series 1 (B)),Net Curr (Cerberus Series 1 (B)),3357,
8222,Net Curr (Cerberus Series 2 (A)),Net Curr (Cerberus Series 2 (A)),3357,
8223,Net Curr (Cerberus Series 2 (B)),Net Curr (Cerberus Series 2 (B)),3357,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8224,Net Curr (Cerberus Series Four (A)),Net Curr (Cerberus Series Four (A)),2446,
8225,Net Curr (Cerberus Series Four (B)),Net Curr (Cerberus Series Four (B)),2446,
8226,Net Curr (Cerberus Series Four (C)),Net Curr (Cerberus Series Four (C)),2446,
8227,Net Curr (Cerberus Series Four (D)),Net Curr (Cerberus Series Four (D)),2446,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8233,Net Curr (Charles River XI (A)),Net Curr (Charles River XI (A)),1309,
8234,Net Curr (Charles River XI (B)),Net Curr (Charles River XI (B)),1309,
8236,Net Curr (Charles River XI),Net Curr (Charles River XI),1309,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8237,Net Curr (Charles River XII (A)),Net Curr (Charles River XII (A)),3021,
8238,Net Curr (Charles River XII (B)),Net Curr (Charles River XII (B)),3021,
8239,Net Curr (Charles River XII (B)),Net Curr (Charles River XII (B)),3021,
8240,Net Curr (Charles River XII (C)),Net Curr (Charles River XII (C)),3021,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8247,Net Curr (Charterhouse VII (A)),Net Curr (Charterhouse VII (A)),1614,
8248,Net Curr (Charterhouse VII (B)),Net Curr (Charterhouse VII (B)),1614,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8249,Net Curr (Charterhouse VIII (A)),Net Curr (Charterhouse VIII (A)),1769,
8250,Net Curr (Charterhouse VIII (B)),Net Curr (Charterhouse VIII (B)),1769,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8260,Net Curr (Cinven IV (A)),Net Curr (Cinven IV (A)),1257,
8261,Net Curr (Cinven IV (B)),Net Curr (Cinven IV (B)),1257,
8262,Net Curr (Cinven IV (C)),Net Curr (Cinven IV (C)),1257,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8264,Net Curr (Clarity Partners (A)),Net Curr (Clarity Partners (A)),2564,
8265,Net Curr (Clarity Partners (B)),Net Curr (Clarity Partners (B)),2564,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8266,Net Curr (Clarity Partners II (A)),Net Curr (Clarity Partners II (A)),4174,
8267,Net Curr (Clarity Partners II (B)),Net Curr (Clarity Partners II (B)),4174,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8272,Net Curr (Clearwater III (A)),Net Curr (Clearwater III (A)),1468,
8273,Net Curr (Clearwater III (A)),Net Curr (Clearwater III (A)),1468,
8274,Net Curr (Clearwater III (B)),Net Curr (Clearwater III (B)),1468,
8275,Net Curr (Clearwater III (B)),Net Curr (Clearwater III (B)),1468,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8276,Net Curr (Clearwater III Annex (A)),Net Curr (Clearwater III Annex (A)),1444,
8277,Net Curr (Clearwater III Annex (B)),Net Curr (Clearwater III Annex (B)),1444,
8278,Net Curr (Clearwater III Annex),Net Curr (Clearwater III Annex),1444,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8280,Net Curr (Clessidra II (A)),Net Curr (Clessidra II (A)),1781,
8281,Net Curr (Clessidra II (B)),Net Curr (Clessidra II (B)),1781,
8282,Net Curr (Clessidra II (C)),Net Curr (Clessidra II (C)),1781,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8283,Net Curr (Clyde Blowers II (A)),Net Curr (Clyde Blowers II (A)),920,
8284,Net Curr (Clyde Blowers II (B)),Net Curr (Clyde Blowers II (B)),920,
8285,Net Curr (Clyde Blowers II),Net Curr (Clyde Blowers II),920,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8286,Net Curr (CM Equity II (A)),Net Curr (CM Equity II (A)),2704,
8287,Net Curr (CM Equity II (B)),Net Curr (CM Equity II (B)),2704,
8288,Net Curr (CM Equity II),Net Curr (CM Equity II),2704,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8298,Net Curr (Commonwealth III (A)),Net Curr (Commonwealth III (A)),2821,
8299,Net Curr (Commonwealth III (B)),Net Curr (Commonwealth III (B)),2821,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8301,Net Curr (ComVentures VI (A)),Net Curr (ComVentures VI (A)),458,
8302,Net Curr (ComVentures VI (B)),Net Curr (ComVentures VI (B)),458,
8303,Net Curr (ComVentures VI),Net Curr (ComVentures VI),458,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8304,Net Curr (Constellation II (A)),Net Curr (Constellation II (A)),2571,
8305,Net Curr (Constellation II (B)),Net Curr (Constellation II (B)),2571,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8309,Net Curr (CorpFin II (A)),Net Curr (CorpFin II (A)),3050,
8310,Net Curr (CorpFin II (B)),Net Curr (CorpFin II (B)),3050,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8314,Net Curr (Crimson Asia (A)),Net Curr (Crimson Asia (A)),1674,
8315,Net Curr (Crimson Asia (B)),Net Curr (Crimson Asia (B)),1674,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8321,Net Curr (CVC European IV (A)),Net Curr (CVC European IV (A)),1960,
8322,Net Curr (CVC European IV (B)),Net Curr (CVC European IV (B)),1960,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8324,Net Curr (CVC I),Net Curr (CVC I),4908,
8340,Net Curr (CVC V (A)),Net Curr (CVC V (A)),4908,
8341,Net Curr (CVC V (B)),Net Curr (CVC V (B)),4908,
8342,Net Curr (CVC V (C)),Net Curr (CVC V (C)),4908,
8343,Net Curr (CVC V),Net Curr (CVC V),4908,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8325,Net Curr (CVC III (A)),Net Curr (CVC III (A)),6608,
8326,Net Curr (CVC III (A)),Net Curr (CVC III (A)),6608,
8327,Net Curr (CVC III (B)),Net Curr (CVC III (B)),6608,
8328,Net Curr (CVC III (B)),Net Curr (CVC III (B)),6608,

7

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8329,Net Curr (CVC IV (A)),Net Curr (CVC IV (A)),3533,
8330,Net Curr (CVC IV (B)),Net Curr (CVC IV (B)),3533,
8331,Net Curr (CVC IV (C)),Net Curr (CVC IV (C)),3533,
8332,Net Curr (CVC IV (D)),Net Curr (CVC IV (D)),3533,
8333,Net Curr (CVC IV (E)),Net Curr (CVC IV (E)),3533,
8334,Net Curr (CVC IV (F)),Net Curr (CVC IV (F)),3533,
8339,Net Curr (CVC IV),Net Curr (CVC IV),3533,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8335,Net Curr (CVC IV Tandem (A)),Net Curr (CVC IV Tandem (A)),1625,
8336,Net Curr (CVC IV Tandem (B)),Net Curr (CVC IV Tandem (B)),1625,
8337,Net Curr (CVC IV Tandem (C)),Net Curr (CVC IV Tandem (C)),1625,
8338,Net Curr (CVC IV Tandem (D)),Net Curr (CVC IV Tandem (D)),1625,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8353,Net Curr (DCM III (A)),Net Curr (DCM III (A)),7418,
8354,Net Curr (DCM III (B)),Net Curr (DCM III (B)),7418,
8355,Net Curr (DCM III),Net Curr (DCM III),7418,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8356,Net Curr (DCM IV (A)),Net Curr (DCM IV (A)),1329,
8357,Net Curr (DCM IV (A)),Net Curr (DCM IV (A)),1329,
8358,Net Curr (DCM IV (B)),Net Curr (DCM IV (B)),1329,
8359,Net Curr (DCM IV (B)),Net Curr (DCM IV (B)),1329,
8360,Net Curr (DCM IV (C)),Net Curr (DCM IV (C)),1329,
8361,Net Curr (DCM IV),Net Curr (DCM IV),1329,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8362,Net Curr (DCM V (A)),Net Curr (DCM V (A)),1167,
8363,Net Curr (DCM V (B)),Net Curr (DCM V (B)),1167,
8364,Net Curr (DCM V (C)),Net Curr (DCM V (C)),1167,
8365,Net Curr (DCM V),Net Curr (DCM V),1167,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8369,Net Curr (Delphi VI (A)),Net Curr (Delphi VI (A)),663,
8370,Net Curr (Delphi VI (B)),Net Curr (Delphi VI (B)),663,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8377,Net Curr (DFJ VIII (A)),Net Curr (DFJ VIII (A)),434,
8378,Net Curr (DFJ VIII (B)),Net Curr (DFJ VIII (B)),434,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8379,Net Curr (DH IV (A)),Net Curr (DH IV (A)),3431,
8380,Net Curr (DH IV (B)),Net Curr (DH IV (B)),3431,
8381,Net Curr (DH IV (C)),Net Curr (DH IV (C)),3431,
8382,Net Curr (DH IV (D)),Net Curr (DH IV (D)),3431,
8383,Net Curr (DH IV),Net Curr (DH IV),3431,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8385,Net Curr (DH V (A)),Net Curr (DH V (A)),2455,
8386,Net Curr (DH V (A)),Net Curr (DH V (A)),2455,
8387,Net Curr (DH V (B)),Net Curr (DH V (B)),2455,
8388,Net Curr (DH V (B)),Net Curr (DH V (B)),2455,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8389,Net Curr (Domain VI (A)),Net Curr (Domain VI (A)),3240,
8390,Net Curr (Domain VI (B)),Net Curr (Domain VI (B)),3240,
8391,Net Curr (Domain VI (C)),Net Curr (Domain VI (C)),3240,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8392,Net Curr (Domain VII (A)),Net Curr (Domain VII (A)),1160,
8393,Net Curr (Domain VII (B)),Net Curr (Domain VII (B)),1160,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8396,Net Curr (Draper Fisher VII (A)),Net Curr (Draper Fisher VII (A)),2159,
8397,Net Curr (Draper Fisher VII (B)),Net Curr (Draper Fisher VII (B)),2159,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8413,Net Curr (EESI (A)),Net Curr (EESI (A)),2047,
8414,Net Curr (EESI (A)),Net Curr (EESI (A)),2047,
8415,Net Curr (EESI (B)),Net Curr (EESI (B)),2047,
8416,Net Curr (EESI (C)),Net Curr (EESI (C)),2047,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8434,Net Curr (Energy Capital I (A)),Net Curr (Energy Capital I (A)),6717,
8435,Net Curr (Energy Capital I (B)),Net Curr (Energy Capital I (B)),6717,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8438,Net Curr (EQT V (A)),Net Curr (EQT V (A)),2944,
8439,Net Curr (EQT V (A)),Net Curr (EQT V (A)),2944,
8440,Net Curr (EQT V (B)),Net Curr (EQT V (B)),2944,
8441,Net Curr (EQT V (B)),Net Curr (EQT V (B)),2944,
8442,Net Curr (EQT V (C)),Net Curr (EQT V (C)),2944,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8445,Net Curr (Equistone III (A)),Net Curr (Equistone III (A)),3982,
8446,Net Curr (Equistone III (B)),Net Curr (Equistone III (B)),3982,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8450,Net Curr (Esprit 1 (A)),Net Curr (Esprit 1 (A)),3063,
8451,Net Curr (Esprit 1 (B)),Net Curr (Esprit 1 (B)),3063,
8454,Net Curr (Esprit I),Net Curr (Esprit I),3063,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8452,Net Curr (Esprit Fund 1),Net Curr (Esprit Fund 1),2088,
8453,Net Curr (Esprit Fund 2),Net Curr (Esprit Fund 2),2088,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8463,Net Curr (Exponent II (A)),Net Curr (Exponent II (A)),2963,
8464,Net Curr (Exponent II (B)),Net Curr (Exponent II (B)),2963,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8473,Net Curr (Fenway III (A)),Net Curr (Fenway III (A)),1871,
8474,Net Curr (Fenway III (B)),Net Curr (Fenway III (B)),1871,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8478,Net Curr (FFL II (A)),Net Curr (FFL II (A)),1952,
8479,Net Curr (FFL II (B)),Net Curr (FFL II (B)),1952,
8480,Net Curr (FFL II),Net Curr (FFL II),1952,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8498,Net Curr (Forward IV (A)),Net Curr (Forward IV (A)),913,
8499,Net Curr (Forward IV (B)),Net Curr (Forward IV (B)),913,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8509,Net Curr (France PE III (A)),Net Curr (France PE III (A)),2661,
8510,Net Curr (France PE III (B)),Net Curr (France PE III (B)),2661,
8511,Net Curr (France PE III),Net Curr (France PE III),2661,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8515,Net Curr (Francisco Partners (A)),Net Curr (Francisco Partners (A)),1739,
8516,Net Curr (Francisco Partners (B)),Net Curr (Francisco Partners (B)),1739,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8531,Net Curr (Gemini Israel IV (A)),Net Curr (Gemini Israel IV (A)),696,
8532,Net Curr (Gemini Israel IV (A)),Net Curr (Gemini Israel IV (A)),696,
8533,Net Curr (Gemini Israel IV (B)),Net Curr (Gemini Israel IV (B)),696,
8534,Net Curr (Gemini Israel IV (B)),Net Curr (Gemini Israel IV (B)),696,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8542,Net Curr (Genstar V (A)),Net Curr (Genstar V (A)),6966,
8543,Net Curr (Genstar V (B)),Net Curr (Genstar V (B)),6966,
8544,Net Curr (Genstar V),Net Curr (Genstar V),6966,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8559,Net Curr (Golden Gate Annex II (A)),Net Curr (Golden Gate Annex II (A)),3580,
8560,Net Curr (Golden Gate Annex II (B)),Net Curr (Golden Gate Annex II (B)),3580,

6

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8561,Net Curr (Golden Gate II (A)),Net Curr (Golden Gate II (A)),912,
8562,Net Curr (Golden Gate II (B)),Net Curr (Golden Gate II (B)),912,
8563,Net Curr (Golden Gate II (C)),Net Curr (Golden Gate II (C)),912,
8564,Net Curr (Golden Gate II),Net Curr (Golden Gate II),912,
8565,Net Curr (Golden Gate II-A (A)),Net Curr (Golden Gate II-A (A)),912,
8566,Net Curr (Golden Gate II-A (B)),Net Curr (Golden Gate II-A (B)),912,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8573,Net Curr (Graphite VI (A)),Net Curr (Graphite VI (A)),2988,
8574,Net Curr (Graphite VI (B)),Net Curr (Graphite VI (B)),2988,
8575,Net Curr (Graphite VI (C)),Net Curr (Graphite VI (C)),2988,
8576,Net Curr (Graphite VI (D)),Net Curr (Graphite VI (D)),2988,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8577,Net Curr (Graphite VII (A)),Net Curr (Graphite VII (A)),1221,
8578,Net Curr (Graphite VII (B)),Net Curr (Graphite VII (B)),1221,
8579,Net Curr (Graphite VII (C)),Net Curr (Graphite VII (C)),1221,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8583,Net Curr (Green Equity IV (A)),Net Curr (Green Equity IV (A)),1804,
8584,Net Curr (Green Equity IV (B)),Net Curr (Green Equity IV (B)),1804,
8585,Net Curr (Green Equity IV),Net Curr (Green Equity IV),1804,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8588,Net Curr (Greylock (A)),Net Curr (Greylock (A)),1325,
8589,Net Curr (Greylock (B)),Net Curr (Greylock (B)),1325,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8591,Net Curr (Grotech VI (A)),Net Curr (Grotech VI (A)),3555,
8592,Net Curr (Grotech VI (B)),Net Curr (Grotech VI (B)),3555,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8596,Net Curr (GS Cap V (A)),Net Curr (GS Cap V (A)),1854,
8597,Net Curr (GS Cap V (B)),Net Curr (GS Cap V (B)),1854,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8605,Net Curr (GSR Ventures II (A)),Net Curr (GSR Ventures II (A)),2048,
8606,Net Curr (GSR Ventures II (B)),Net Curr (GSR Ventures II (B)),2048,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8607,Net Curr (GTCR VIII (A)),Net Curr (GTCR VIII (A)),2720,
8608,Net Curr (GTCR VIII (B)),Net Curr (GTCR VIII (B)),2720,
8610,Net Curr (GTCR VIII),Net Curr (GTCR VIII),2720,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8613,Net Curr (Halifax (A)),Net Curr (Halifax (A)),1544,
8614,Net Curr (Halifax (B)),Net Curr (Halifax (B)),1544,
8615,Net Curr (Halifax (C)),Net Curr (Halifax (C)),1544,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8618,Net Curr (Harbour IV (A)),Net Curr (Harbour IV (A)),3149,
8619,Net Curr (Harbour IV (B)),Net Curr (Harbour IV (B)),3149,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8631,Net Curr (Healthcare Ventures VIII (A)),Net Curr (Healthcare Ventures VIII (A)),2163,
8632,Net Curr (Healthcare Ventures VIII (B)),Net Curr (Healthcare Ventures VIII (B)),2163,
8633,Net Curr (Healthcare Ventures VIII),Net Curr (Healthcare Ventures VIII),2163,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8639,Net Curr (HEI Hospitality II),Net Curr (HEI Hospitality II),0,
8640,Net Curr (HEI Hospitality),Net Curr (HEI Hospitality),0,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8643,Net Curr (HgCapital 5 (A)),Net Curr (HgCapital 5 (A)),924,
8644,Net Curr (HgCapital 5 (B)),Net Curr (HgCapital 5 (B)),924,
8645,Net Curr (HgCapital 5 (C)),Net Curr (HgCapital 5 (C)),924,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8647,Net Curr (HIG Bayside Debt II (A)),Net Curr (HIG Bayside Debt II (A)),4958,
8648,Net Curr (HIG Bayside Debt II (B)),Net Curr (HIG Bayside Debt II (B)),4958,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8649,Net Curr (HIG Bayside Opp (A)),Net Curr (HIG Bayside Opp (A)),826,
8650,Net Curr (HIG Bayside Opp (B)),Net Curr (HIG Bayside Opp (B)),826,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8652,Net Curr (HIG IV (A)),Net Curr (HIG IV (A)),3708,
8653,Net Curr (HIG IV (B)),Net Curr (HIG IV (B)),3708,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8655,Net Curr (HIG Partners III (A)),Net Curr (HIG Partners III (A)),2547,
8656,Net Curr (HIG Partners III (B)),Net Curr (HIG Partners III (B)),2547,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8667,Net Curr (Highland VI (A)),Net Curr (Highland VI (A)),2719,
8668,Net Curr (Highland VI (A)),Net Curr (Highland VI (A)),2719,
8669,Net Curr (Highland VI (B)),Net Curr (Highland VI (B)),2719,
8670,Net Curr (Highland VI (B)),Net Curr (Highland VI (B)),2719,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8671,Net Curr (Highland VII (A)),Net Curr (Highland VII (A)),2534,
8672,Net Curr (Highland VII (B)),Net Curr (Highland VII (B)),2534,
8673,Net Curr (Highland VII),Net Curr (Highland VII),2534,
8674,Net Curr (Highland VII),Net Curr (Highland VII),2534,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8689,Net Curr (IDG Accel China II (A)),Net Curr (IDG Accel China II (A)),1754,
8690,Net Curr (IDG Accel China II (B)),Net Curr (IDG Accel China II (B)),1754,
8691,Net Curr (IDG Accel China II (C)),Net Curr (IDG Accel China II (C)),1754,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8692,Net Curr (IDG Growth I (A)),Net Curr (IDG Growth I (A)),5032,
8693,Net Curr (IDG Growth I (B)),Net Curr (IDG Growth I (B)),5032,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8703,Net Curr (IK 2007 III (A)),Net Curr (IK 2007 III (A)),6313,
8704,Net Curr (IK 2007 III (B)),Net Curr (IK 2007 III (B)),6313,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8709,Net Curr (Index IV (A)),Net Curr (Index IV (A)),868,
8710,Net Curr (Index IV (A)),Net Curr (Index IV (A)),868,
8711,Net Curr (Index IV (B)),Net Curr (Index IV (B)),868,
8712,Net Curr (Index IV (B)),Net Curr (Index IV (B)),868,
8713,Net Curr (Index IV (C)),Net Curr (Index IV (C)),868,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8714,Net Curr (Index V (A)),Net Curr (Index V (A)),3317,
8715,Net Curr (Index V (B)),Net Curr (Index V (B)),3317,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8718,Net Curr (Indigo V (A)),Net Curr (Indigo V (A)),1699,
8719,Net Curr (Indigo V (B)),Net Curr (Indigo V (B)),1699,
8720,Net Curr (Indigo V (C)),Net Curr (Indigo V (C)),1699,
8721,Net Curr (Indigo V),Net Curr (Indigo V),1699,
8722,Net Curr (Indigo V),Net Curr (Indigo V),1699,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8747,Net Curr (InterWest VIII (A)),Net Curr (InterWest VIII (A)),3314,
8748,Net Curr (Interwest VIII (B)),Net Curr (Interwest VIII (B)),3314,
8749,Net Curr (InterWest VIII),Net Curr (InterWest VIII),3314,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8754,Net Curr (Investitori Associati IV (A)),Net Curr (Investitori Associati IV (A)),1596,
8755,Net Curr (Investitori Associati IV (B)),Net Curr (Investitori Associati IV (B)),1596,
8756,Net Curr (Investitori Associati IV),Net Curr (Investitori Associati IV),1596,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8763,Net Curr (Japan Ireland (A)),Net Curr (Japan Ireland (A)),3245,
8764,Net Curr (Japan Ireland (A)),Net Curr (Japan Ireland (A)),3245,
8765,Net Curr (Japan Ireland (B)),Net Curr (Japan Ireland (B)),3245,
8766,Net Curr (Japan Ireland (B)),Net Curr (Japan Ireland (B)),3245,
8767,Net Curr (Japan Ireland (C)),Net Curr (Japan Ireland (C)),3245,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8769,Net Curr (JC Flowers I),Net Curr (JC Flowers I),3766,
8771,Net Curr (JC Flowers),Net Curr (JC Flowers),3766,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8782,Net Curr (JVP III (A)),Net Curr (JVP III (A)),3704,
8783,Net Curr (JVP III (B)),Net Curr (JVP III (B)),3704,
8785,Net Curr (JVP III),Net Curr (JVP III),3704,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8788,Net Curr (JW Childs II (A)),Net Curr (JW Childs II (A)),1698,
8789,Net Curr (JW Childs II (B)),Net Curr (JW Childs II (B)),1698,
8790,Net Curr (JW Childs II (C)),Net Curr (JW Childs II (C)),1698,
8791,Net Curr (JW Childs II),Net Curr (JW Childs II),1698,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8792,Net Curr (JW Childs III (A)),Net Curr (JW Childs III (A)),3821,
8793,Net Curr (JW Childs III (B)),Net Curr (JW Childs III (B)),3821,
8794,Net Curr (JW Childs III (C)),Net Curr (JW Childs III (C)),3821,
8795,Net Curr (JW Childs III),Net Curr (JW Childs III),3821,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8796,Net Curr (Kelso VII (A)),Net Curr (Kelso VII (A)),1500,
8797,Net Curr (Kelso VII (A)),Net Curr (Kelso VII (A)),1500,
8798,Net Curr (Kelso VII (B)),Net Curr (Kelso VII (B)),1500,
8799,Net Curr (Kelso VII (B)),Net Curr (Kelso VII (B)),1500,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8801,Net Curr (Kennet II (A)),Net Curr (Kennet II (A)),5409,
8802,Net Curr (Kennet II (B)),Net Curr (Kennet II (B)),5409,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8814,Net Curr (KKR European Fund II (A)),Net Curr (KKR European Fund II (A)),1315,
8815,Net Curr (KKR European Fund II (B)),Net Curr (KKR European Fund II (B)),1315,
8816,Net Curr (KKR European Fund II),Net Curr (KKR European Fund II),1315,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8817,Net Curr (Kodiak II (A)),Net Curr (Kodiak II (A)),2701,
8818,Net Curr (Kodiak II (B)),Net Curr (Kodiak II (B)),2701,
8819,Net Curr (Kodiak II (C)),Net Curr (Kodiak II (C)),2701,
8820,Net Curr (Kodiak II-A),Net Curr (Kodiak II-A),2701,
8821,Net Curr (Kodiak II-B),Net Curr (Kodiak II-B),2701,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8822,Net Curr (Kodiak III (A)),Net Curr (Kodiak III (A)),3189,
8823,Net Curr (Kodiak III (B)),Net Curr (Kodiak III (B)),3189,
8824,Net Curr (Kodiak III),Net Curr (Kodiak III),3189,
8825,Net Curr (Kodiak III),Net Curr (Kodiak III),3189,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8828,Net Curr (KPCB XI (A)),Net Curr (KPCB XI (A)),1448,
8829,Net Curr (KPCB XI (B)),Net Curr (KPCB XI (B)),1448,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8835,Net Curr (Lake Capital II (A)),Net Curr (Lake Capital II (A)),1395,
8836,Net Curr (Lake Capital II (B)),Net Curr (Lake Capital II (B)),1395,
8837,Net Curr (Lake Capital II (C)),Net Curr (Lake Capital II (C)),1395,
8838,Net Curr (Lake Capital II),Net Curr (Lake Capital II),1395,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8846,Net Curr (Lexington VII (A)),Net Curr (Lexington VII (A)),3213,
8847,Net Curr (Lexington VII (B)),Net Curr (Lexington VII (B)),3213,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8848,Net Curr (Liberty II (A)),Net Curr (Liberty II (A)),1813,
8849,Net Curr (Liberty II (B)),Net Curr (Liberty II (B)),1813,
8850,Net Curr (Liberty II),Net Curr (Liberty II),1813,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8851,Net Curr (Lightyear II (A)),Net Curr (Lightyear II (A)),3032,
8852,Net Curr (Lightyear II (B)),Net Curr (Lightyear II (B)),3032,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8863,Net Curr (Livingbridge 4),Net Curr (Livingbridge 4),3098,
8864,Net Curr (Livingbridge 4),Net Curr (Livingbridge 4),3098,
8865,Net Curr (Livingbridge 5),Net Curr (Livingbridge 5),3098,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8867,Net Curr (Longreach 1 (A)),Net Curr (Longreach 1 (A)),3654,
8868,Net Curr (Longreach 1 (B)),Net Curr (Longreach 1 (B)),3654,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8870,Net Curr (LSVP VII (A)),Net Curr (LSVP VII (A)),3382,
8871,Net Curr (LSVP VII (A)),Net Curr (LSVP VII (A)),3382,
8872,Net Curr (LSVP VII (B)),Net Curr (LSVP VII (B)),3382,
8873,Net Curr (LSVP VII (B)),Net Curr (LSVP VII (B)),3382,
8874,Net Curr (LSVP VII (C)),Net Curr (LSVP VII (C)),3382,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8877,Net Curr (Madison Dearborn IV (A)),Net Curr (Madison Dearborn IV (A)),865,
8878,Net Curr (Madison Dearborn IV (B)),Net Curr (Madison Dearborn IV (B)),865,
8879,Net Curr (Madison Dearborn IV (C)),Net Curr (Madison Dearborn IV (C)),865,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8880,Net Curr (Madison Dearborn V (A)),Net Curr (Madison Dearborn V (A)),465,
8881,Net Curr (Madison Dearborn V (B)),Net Curr (Madison Dearborn V (B)),465,
8882,Net Curr (Madison Dearborn V (C)),Net Curr (Madison Dearborn V (C)),465,
8883,Net Curr (Madison Dearborn V (D)),Net Curr (Madison Dearborn V (D)),465,
8884,Net Curr (Madison Dearborn V),Net Curr (Madison Dearborn V),465,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8890,Net Curr (MatlinPatterson II (A)),Net Curr (MatlinPatterson II (A)),5036,
8891,Net Curr (MatlinPatterson II (A)),Net Curr (MatlinPatterson II (A)),5036,
8892,Net Curr (MatlinPatterson II (B)),Net Curr (MatlinPatterson II (B)),5036,
8893,Net Curr (MatlinPatterson II (B)),Net Curr (MatlinPatterson II (B)),5036,
8894,Net Curr (MatlinPatterson II (C)),Net Curr (MatlinPatterson II (C)),5036,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8895,Net Curr (MatlinPatterson II Pref (A)),Net Curr (MatlinPatterson II Pref (A)),2560,
8896,Net Curr (MatlinPatterson II Pref (B)),Net Curr (MatlinPatterson II Pref (B)),2560,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8898,Net Curr (MatlinPatterson III (A)),Net Curr (MatlinPatterson III (A)),3394,
8899,Net Curr (MatlinPatterson III (B)),Net Curr (MatlinPatterson III (B)),3394,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8901,Net Curr (Mayfield XI (A)),Net Curr (Mayfield XI (A)),909,
8902,Net Curr (Mayfield XI (B)),Net Curr (Mayfield XI (B)),909,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8903,Net Curr (Mayfield XII (A)),Net Curr (Mayfield XII (A)),3454,
8904,Net Curr (Mayfield XII (B)),Net Curr (Mayfield XII (B)),3454,
8905,Net Curr (Mayfield XII),Net Curr (Mayfield XII),3454,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8910,Net Curr (McMakler (A)),Net Curr (McMakler (A)),1956,
8911,Net Curr (McMakler (B)),Net Curr (McMakler (B)),1956,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8920,Net Curr (Menlo IX (A)),Net Curr (Menlo IX (A)),3460,
8921,Net Curr (Menlo IX (B)),Net Curr (Menlo IX (B)),3460,
8922,Net Curr (Menlo IX (C)),Net Curr (Menlo IX (C)),3460,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8923,Net Curr (Menlo X (A)),Net Curr (Menlo X (A)),3107,
8924,Net Curr (Menlo X (A)),Net Curr (Menlo X (A)),3107,
8925,Net Curr (Menlo X (B)),Net Curr (Menlo X (B)),3107,
8926,Net Curr (Menlo X (B)),Net Curr (Menlo X (B)),3107,
8927,Net Curr (Menlo X (C)),Net Curr (Menlo X (C)),3107,
8928,Net Curr (Menlo X (D)),Net Curr (Menlo X (D)),3107,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8932,Net Curr (Mercapital III (A)),Net Curr (Mercapital III (A)),2384,
8933,Net Curr (Mercapital III (B)),Net Curr (Mercapital III (B)),2384,
8934,Net Curr (Mercapital III (C)),Net Curr (Mercapital III (C)),2384,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8940,Net Curr (MHR III (A)),Net Curr (MHR III (A)),1837,
8941,Net Curr (MHR III (B)),Net Curr (MHR III (B)),1837,
8942,Net Curr (MHR III (C)),Net Curr (MHR III (C)),1837,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8948,Net Curr (Midmark II (A)),Net Curr (Midmark II (A)),2016,
8949,Net Curr (Midmark II (B)),Net Curr (Midmark II (B)),2016,
8950,Net Curr (Midmark II),Net Curr (Midmark II),2016,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8960,Net Curr (Morgenthaler VIII (A)),Net Curr (Morgenthaler VIII (A)),1019,
8961,Net Curr (Morgenthaler VIII (B)),Net Curr (Morgenthaler VIII (B)),1019,
8962,Net Curr (Morgenthaler VIII (C)),Net Curr (Morgenthaler VIII (C)),1019,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8963,Net Curr (Motion II (A)),Net Curr (Motion II (A)),928,
8964,Net Curr (Motion II (B)),Net Curr (Motion II (B)),928,
8965,Net Curr (Motion II),Net Curr (Motion II),928,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8966,Net Curr (MPM Bio III (A)),Net Curr (MPM Bio III (A)),934,
8967,Net Curr (MPM Bio III (B)),Net Curr (MPM Bio III (B)),934,
8968,Net Curr (MPM Bio III (C)),Net Curr (MPM Bio III (C)),934,
8969,Net Curr (MPM Bio III (D)),Net Curr (MPM Bio III (D)),934,
8970,Net Curr (MPM Bio III (E)),Net Curr (MPM Bio III (E)),934,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8971,Net Curr (MPM Bio IV (A)),Net Curr (MPM Bio IV (A)),2554,
8972,Net Curr (MPM Bio IV (B)),Net Curr (MPM Bio IV (B)),2554,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8973,Net Curr (MPM BioVentures IV (A)),Net Curr (MPM BioVentures IV (A)),3267,
8974,Net Curr (MPM Bioventures IV (B)),Net Curr (MPM Bioventures IV (B)),3267,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8980,Net Curr (Nautic V (A)),Net Curr (Nautic V (A)),1815,
8981,Net Curr (Nautic V (B)),Net Curr (Nautic V (B)),1815,
8982,Net Curr (Nautic V),Net Curr (Nautic V),1815,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8983,Net Curr (Nautic VI (A)),Net Curr (Nautic VI (A)),1795,
8984,Net Curr (Nautic VI (B)),Net Curr (Nautic VI (B)),1795,
8985,Net Curr (Nautic VI),Net Curr (Nautic VI),1795,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8987,Net Curr (Navis Asia V (A)),Net Curr (Navis Asia V (A)),2515,
8988,Net Curr (Navis Asia V (B)),Net Curr (Navis Asia V (B)),2515,
8989,Net Curr (Navis Asia V (C)),Net Curr (Navis Asia V (C)),2515,
8990,Net Curr (Navis Asia V),Net Curr (Navis Asia V),2515,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8993,Net Curr (NEA IX (A)),Net Curr (NEA IX (A)),823,
8994,Net Curr (NEA IX (B)),Net Curr (NEA IX (B)),823,
8995,Net Curr (NEA IX),Net Curr (NEA IX),823,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8996,Net Curr (NEA VIII),Net Curr (NEA VIII),1387,
8997,Net Curr (NEA VIII-A),Net Curr (NEA VIII-A),1387,

7

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
8998,Net Curr (NEA X (A)),Net Curr (NEA X (A)),2565,
8999,Net Curr (NEA X (A)),Net Curr (NEA X (A)),2565,
9000,Net Curr (NEA X (B)),Net Curr (NEA X (B)),2565,
9001,Net Curr (NEA X (B)),Net Curr (NEA X (B)),2565,
9002,Net Curr (NEA X (C)),Net Curr (NEA X (C)),2565,
9003,Net Curr (NEA X (D)),Net Curr (NEA X (D)),2565,
9004,Net Curr (NEA X (E)),Net Curr (NEA X (E)),2565,
9005,Net Curr (NEA X (F)),Net Curr (NEA X (F)),2565,
9006,Net Curr (NEA X),Net Curr (NEA X),2565,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9007,Net Curr (NEA XI (A)),Net Curr (NEA XI (A)),686,
9008,Net Curr (NEA XI (A)),Net Curr (NEA XI (A)),686,
9009,Net Curr (NEA XI (A)),Net Curr (NEA XI (A)),686,
9010,Net Curr (NEA XI (A)),Net Curr (NEA XI (A)),686,
9011,Net Curr (NEA XI (B)),Net Curr (NEA XI (B)),686,
9012,Net Curr (NEA XI (B)),Net Curr (NEA XI (B)),686,
9013,Net Curr (NEA XI (B)),Net Curr (NEA XI (B)),686,
9014,Net Curr (NEA XI (C)),Net Curr (NEA XI (C)),686,
9015,Net Curr (NEA XI (E)),Net Curr (NEA XI (E)),686,
9016,Net Curr (NEA XI (F)),Net Curr (NEA XI (F)),686,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9017,Net Curr (NEA XII (A)),Net Curr (NEA XII (A)),2108,
9018,Net Curr (NEA XII (A)),Net Curr (NEA XII (A)),2108,
9019,Net Curr (NEA XII (B)),Net Curr (NEA XII (B)),2108,
9020,Net Curr (NEA XII (B)),Net Curr (NEA XII (B)),2108,
9021,Net Curr (NEA XII (C)),Net Curr (NEA XII (C)),2108,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9028,Net Curr (New Mountain II (A)),Net Curr (New Mountain II (A)),2775,
9029,Net Curr (New Mountain II (B)),Net Curr (New Mountain II (B)),2775,
9030,Net Curr (New Mountain II),Net Curr (New Mountain II),2775,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9031,Net Curr (New Mountain III (A)),Net Curr (New Mountain III (A)),1915,
9032,Net Curr (New Mountain III (B)),Net Curr (New Mountain III (B)),1915,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9036,Net Curr (Newbridge LA (A)),Net Curr (Newbridge LA (A)),1331,
9037,Net Curr (Newbridge LA (B)),Net Curr (Newbridge LA (B)),1331,
9038,Net Curr (Newbridge LA (C)),Net Curr (Newbridge LA (C)),1331,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9046,Net Curr (Nordic V (A)),Net Curr (Nordic V (A)),1174,
9047,Net Curr (Nordic V (B)),Net Curr (Nordic V (B)),1174,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9048,Net Curr (Nordic VI (A)),Net Curr (Nordic VI (A)),947,
9049,Net Curr (Nordic VI (B)),Net Curr (Nordic VI (B)),947,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9054,Net Curr (North Bridge V),Net Curr (North Bridge V),3529,
9055,Net Curr (North Bridge V-A (A)),Net Curr (North Bridge V-A (A)),3529,
9056,Net Curr (North Bridge V-A (B)),Net Curr (North Bridge V-A (B)),3529,
9057,Net Curr (North Bridge V-B (A)),Net Curr (North Bridge V-B (A)),3529,
9058,Net Curr (North Bridge V-B (B)),Net Curr (North Bridge V-B (B)),3529,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9065,Net Curr (Northbridge V (A)),Net Curr (Northbridge V (A)),4942,
9066,Net Curr (Northbridge V (B)),Net Curr (Northbridge V (B)),4942,
9067,Net Curr (Northbridge V),Net Curr (Northbridge V),4942,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9079,Net Curr (OCM IV (A)),Net Curr (OCM IV (A)),5116,
9080,Net Curr (OCM IV (B)),Net Curr (OCM IV (B)),5116,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9084,Net Curr (OCM VII (A)),Net Curr (OCM VII (A)),7059,
9085,Net Curr (OCM VII (B)),Net Curr (OCM VII (B)),7059,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9095,Net Curr (Opus V (A)),Net Curr (Opus V (A)),1630,
9096,Net Curr (Opus V (B)),Net Curr (Opus V (B)),1630,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9104,Net Curr (Oxford Bioscience IV (A)),Net Curr (Oxford Bioscience IV (A)),1296,
9105,Net Curr (Oxford Bioscience IV (B)),Net Curr (Oxford Bioscience IV (B)),1296,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9110,Net Curr (Pacven V (A)),Net Curr (Pacven V (A)),1248,
9111,Net Curr (Pacven V (B)),Net Curr (Pacven V (B)),1248,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9112,Net Curr (Pacven VI (A)),Net Curr (Pacven VI (A)),3553,
9113,Net Curr (Pacven VI (B)),Net Curr (Pacven VI (B)),3553,
9114,Net Curr (Pacven VI),Net Curr (Pacven VI),3553,

6

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9115,Net Curr (PAI Europe IV (A)),Net Curr (PAI Europe IV (A)),2848,
9116,Net Curr (PAI Europe IV (B)),Net Curr (PAI Europe IV (B)),2848,
9117,Net Curr (PAI Europe IV (C)),Net Curr (PAI Europe IV (C)),2848,
9118,Net Curr (PAI Europe IV (D)),Net Curr (PAI Europe IV (D)),2848,
9119,Net Curr (PAI Europe IV (E)),Net Curr (PAI Europe IV (E)),2848,
9120,Net Curr (PAI Europe IV),Net Curr (PAI Europe IV),2848,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9122,Net Curr (Paine III (A)),Net Curr (Paine III (A)),6205,
9123,Net Curr (Paine III (B)),Net Curr (Paine III (B)),6205,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9133,Net Curr (Parthenon II (A)),Net Curr (Parthenon II (A)),6901,
9134,Net Curr (Parthenon II (A)),Net Curr (Parthenon II (A)),6901,
9135,Net Curr (Parthenon II (B)),Net Curr (Parthenon II (B)),6901,
9136,Net Curr (Parthenon II (B)),Net Curr (Parthenon II (B)),6901,
9137,Net Curr (Parthenon II (C)),Net Curr (Parthenon II (C)),6901,
9138,Net Curr (Parthenon II (D)),Net Curr (Parthenon II (D)),6901,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9145,Net Curr (PE Partners IV (A)),Net Curr (PE Partners IV (A)),2900,
9146,Net Curr (PE Partners IV (B)),Net Curr (PE Partners IV (B)),2900,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9157,Net Curr (Permira III (A)),Net Curr (Permira III (A)),2497,
9158,Net Curr (Permira III (A)),Net Curr (Permira III (A)),2497,
9159,Net Curr (Permira III (B)),Net Curr (Permira III (B)),2497,
9160,Net Curr (Permira III (B)),Net Curr (Permira III (B)),2497,
9161,Net Curr (Permira III (C)),Net Curr (Permira III (C)),2497,
9162,Net Curr (Permira III (D)),Net Curr (Permira III (D)),2497,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9163,Net Curr (Permira IV (A)),Net Curr (Permira IV (A)),1816,
9164,Net Curr (Permira IV (B)),Net Curr (Permira IV (B)),1816,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9175,Net Curr (Pitango IV (A)),Net Curr (Pitango IV (A)),3211,
9176,Net Curr (Pitango IV (B)),Net Curr (Pitango IV (B)),3211,
9177,Net Curr (Pitango IV),Net Curr (Pitango IV),3211,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9182,Net Curr (Polaris IV (A)),Net Curr (Polaris IV (A)),417,
9183,Net Curr (Polaris IV (A)),Net Curr (Polaris IV (A)),417,
9184,Net Curr (Polaris IV (B)),Net Curr (Polaris IV (B)),417,
9185,Net Curr (Polaris IV (B)),Net Curr (Polaris IV (B)),417,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9186,Net Curr (Polaris V (A)),Net Curr (Polaris V (A)),3159,
9187,Net Curr (Polaris V (B)),Net Curr (Polaris V (B)),3159,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9188,Net Curr (Polish VI (A)),Net Curr (Polish VI (A)),2513,
9189,Net Curr (Polish VI (B)),Net Curr (Polish VI (B)),2513,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9207,Net Curr (Prospect II (A)),Net Curr (Prospect II (A)),2809,
9208,Net Curr (Prospect II (B)),Net Curr (Prospect II (B)),2809,
9209,Net Curr (Prospect II (C)),Net Curr (Prospect II (C)),2809,
9210,Net Curr (Prospect II),Net Curr (Prospect II),2809,
9211,Net Curr (Prospect II),Net Curr (Prospect II),2809,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9212,Net Curr (Prospect III (A)),Net Curr (Prospect III (A)),2759,
9213,Net Curr (Prospect III (B)),Net Curr (Prospect III (B)),2759,
9214,Net Curr (Prospect III (C)),Net Curr (Prospect III (C)),2759,
9215,Net Curr (Prospect III),Net Curr (Prospect III),2759,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9218,Net Curr (Prospect Venture III (A)),Net Curr (Prospect Venture III (A)),2897,
9219,Net Curr (Prospect Venture III (B)),Net Curr (Prospect Venture III (B)),2897,
9220,Net Curr (Prospect Venture III (C)),Net Curr (Prospect Venture III (C)),2897,
9221,Net Curr (Prospect Venture III),Net Curr (Prospect Venture III),2897,

7

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9223,Net Curr (Providence V (A)),Net Curr (Providence V (A)),1635,
9224,Net Curr (Providence V (A)),Net Curr (Providence V (A)),1635,
9225,Net Curr (Providence V (B)),Net Curr (Providence V (B)),1635,
9226,Net Curr (Providence V (B)),Net Curr (Providence V (B)),1635,
9227,Net Curr (Providence V (C)),Net Curr (Providence V (C)),1635,
9228,Net Curr (Providence V (C)),Net Curr (Providence V (C)),1635,
9229,Net Curr (Providence V (D)),Net Curr (Providence V (D)),1635,
9230,Net Curr (Providence V (D)),Net Curr (Providence V (D)),1635,
9231,Net Curr (Providence V (E)),Net Curr (Providence V (E)),1635,
9232,Net Curr (Providence V (F)),Net Curr (Providence V (F)),1635,
9233,Net Curr (Providence V (G)),Net Curr (Providence V (G)),1635,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9234,Net Curr (Providence VI (A)),Net Curr (Providence VI (A)),3019,
9235,Net Curr (Providence VI (B)),Net Curr (Providence VI (B)),3019,
9236,Net Curr (Providence VI),Net Curr (Providence VI),3019,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9240,Net Curr (Qiming (A)),Net Curr (Qiming (A)),1553,
9241,Net Curr (Qiming (B)),Net Curr (Qiming (B)),1553,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9282,Net Curr (Segulah IV (A)),Net Curr (Segulah IV (A)),1562,
9283,Net Curr (Segulah IV (B)),Net Curr (Segulah IV (B)),1562,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9287,Net Curr (Sequoia Franchise (A)),Net Curr (Sequoia Franchise (A)),1775,
9288,Net Curr (Sequoia Franchise (B)),Net Curr (Sequoia Franchise (B)),1775,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9289,Net Curr (Sequoia Growth III (A)),Net Curr (Sequoia Growth III (A)),3041,
9290,Net Curr (Sequoia Growth III (B)),Net Curr (Sequoia Growth III (B)),3041,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9291,Net Curr (Sequoia I (A)),Net Curr (Sequoia I (A)),1782,
9292,Net Curr (Sequoia I (B)),Net Curr (Sequoia I (B)),1782,
9297,Net Curr (Sequoia X (A)),Net Curr (Sequoia X (A)),1782,
9298,Net Curr (Sequoia X (B)),Net Curr (Sequoia X (B)),1782,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9293,Net Curr (Sequoia Israel III (A)),Net Curr (Sequoia Israel III (A)),3018,
9294,Net Curr (Sequoia Israel III (B)),Net Curr (Sequoia Israel III (B)),3018,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9295,Net Curr (Sequoia IX (A)),Net Curr (Sequoia IX (A)),1643,
9296,Net Curr (Sequoia IX (B)),Net Curr (Sequoia IX (B)),1643,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9299,Net Curr (Sevin Rosen IX (A)),Net Curr (Sevin Rosen IX (A)),3520,
9300,Net Curr (Sevin Rosen IX (A)),Net Curr (Sevin Rosen IX (A)),3520,
9301,Net Curr (Sevin Rosen IX (B)),Net Curr (Sevin Rosen IX (B)),3520,
9302,Net Curr (Sevin Rosen IX (B)),Net Curr (Sevin Rosen IX (B)),3520,
9303,Net Curr (Sevin Rosen IX (C)),Net Curr (Sevin Rosen IX (C)),3520,
9304,Net Curr (Sevin Rosen IX (C)),Net Curr (Sevin Rosen IX (C)),3520,
9305,Net Curr (Sevin Rosen IX (D)),Net Curr (Sevin Rosen IX (D)),3520,
9306,Net Curr (Sevin Rosen IX),Net Curr (Sevin Rosen IX),3520,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9308,Net Curr (Sevin Rosen VIII (A)),Net Curr (Sevin Rosen VIII (A)),3051,
9309,Net Curr (Sevin Rosen VIII (A)),Net Curr (Sevin Rosen VIII (A)),3051,
9310,Net Curr (Sevin Rosen VIII (B)),Net Curr (Sevin Rosen VIII (B)),3051,
9311,Net Curr (Sevin Rosen VIII (B)),Net Curr (Sevin Rosen VIII (B)),3051,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9314,Net Curr (ShoreView (A)),Net Curr (ShoreView (A)),1227,
9315,Net Curr (ShoreView (B)),Net Curr (ShoreView (B)),1227,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9319,Net Curr (Sierra VIII),Net Curr (Sierra VIII),356,
9320,Net Curr (Sierra VIII-A),Net Curr (Sierra VIII-A),356,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9324,Net Curr (Silver Lake III (A)),Net Curr (Silver Lake III (A)),3537,
9325,Net Curr (Silver Lake III (A)),Net Curr (Silver Lake III (A)),3537,
9326,Net Curr (Silver Lake III (B)),Net Curr (Silver Lake III (B)),3537,
9327,Net Curr (Silver Lake III (B)),Net Curr (Silver Lake III (B)),3537,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9328,Net Curr (Silver Lake III SPV (A)),Net Curr (Silver Lake III SPV (A)),3480,
9329,Net Curr (Silver Lake III SPV (B)),Net Curr (Silver Lake III SPV (B)),3480,
9330,Net Curr (Silver Lake III SPV-2 (A)),Net Curr (Silver Lake III SPV-2 (A)),3480,
9331,Net Curr (Silver Lake III SPV-2 (B)),Net Curr (Silver Lake III SPV-2 (B)),3480,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9343,Net Curr (Spark Capital I (A)),Net Curr (Spark Capital I (A)),1619,
9344,Net Curr (Spark Capital I (B)),Net Curr (Spark Capital I (B)),1619,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9345,Net Curr (SPC Partners II (A)),Net Curr (SPC Partners II (A)),987,
9346,Net Curr (SPC Partners II (B)),Net Curr (SPC Partners II (B)),987,
9347,Net Curr (SPC Partners II (C)),Net Curr (SPC Partners II (C)),987,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9350,Net Curr (Spec Ops (A)),Net Curr (Spec Ops (A)),463,
9351,Net Curr (Spec Ops (B)),Net Curr (Spec Ops (B)),463,
9352,Net Curr (Spec Ops (C)),Net Curr (Spec Ops (C)),463,
9353,Net Curr (Spec Ops),Net Curr (Spec Ops),463,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9366,Net Curr (Sterling Capital II (A)),Net Curr (Sterling Capital II (A)),2044,
9367,Net Curr (Sterling Capital II (B)),Net Curr (Sterling Capital II (B)),2044,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9376,Net Curr (Storm III (A)),Net Curr (Storm III (A)),1783,
9377,Net Curr (Storm III (A)),Net Curr (Storm III (A)),1783,
9378,Net Curr (Storm III (B)),Net Curr (Storm III (B)),1783,
9379,Net Curr (Storm III (B)),Net Curr (Storm III (B)),1783,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9380,Net Curr (Summit Europe PE (A)),Net Curr (Summit Europe PE (A)),935,
9381,Net Curr (Summit Europe PE (B)),Net Curr (Summit Europe PE (B)),935,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9384,Net Curr (Summit PE (A)),Net Curr (Summit PE (A)),1611,
9385,Net Curr (Summit PE (B)),Net Curr (Summit PE (B)),1611,
9386,Net Curr (Summit PE (C)),Net Curr (Summit PE (C)),1611,
9387,Net Curr (Summit PE (D)),Net Curr (Summit PE (D)),1611,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9390,Net Curr (Summit Sub Debt IV),Net Curr (Summit Sub Debt IV),3389,
9391,Net Curr (Summit Sub Debt IV-A),Net Curr (Summit Sub Debt IV-A),3389,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9393,Net Curr (Summit Venture II (A)),Net Curr (Summit Venture II (A)),6276,
9394,Net Curr (Summit Venture II (B)),Net Curr (Summit Venture II (B)),6276,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9395,Net Curr (Summit VI (A)),Net Curr (Summit VI (A)),1984,
9396,Net Curr (Summit VI (B)),Net Curr (Summit VI (B)),1984,
9397,Net Curr (Summit VI),Net Curr (Summit VI),1984,

7

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9398,Net Curr (Summit VII (A)),Net Curr (Summit VII (A)),4951,
9399,Net Curr (Summit VII (B)),Net Curr (Summit VII (B)),4951,
9400,Net Curr (Summit VII (C)),Net Curr (Summit VII (C)),4951,
9401,Net Curr (Summit VII (D)),Net Curr (Summit VII (D)),4951,
9402,Net Curr (Summit VII),Net Curr (Summit VII),4951,
9403,Net Curr (Summit VII-A),Net Curr (Summit VII-A),4951,
9404,Net Curr (Summit VII-B),Net Curr (Summit VII-B),4951,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9405,Net Curr (Sun III (A)),Net Curr (Sun III (A)),3144,
9406,Net Curr (Sun III (B)),Net Curr (Sun III (B)),3144,
9407,Net Curr (Sun III),Net Curr (Sun III),3144,

6

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9408,Net Curr (Sun IV (A)),Net Curr (Sun IV (A)),2541,
9409,Net Curr (Sun IV (A)),Net Curr (Sun IV (A)),2541,
9410,Net Curr (Sun IV (B)),Net Curr (Sun IV (B)),2541,
9411,Net Curr (Sun IV (B)),Net Curr (Sun IV (B)),2541,
9412,Net Curr (Sun IV (C)),Net Curr (Sun IV (C)),2541,
9413,Net Curr (Sun IV (D)),Net Curr (Sun IV (D)),2541,
9414,Net Curr (Sun IV (E)),Net Curr (Sun IV (E)),2541,
9415,Net Curr (Sun IV),Net Curr (Sun IV),2541,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9416,Net Curr (Sun V (A)),Net Curr (Sun V (A)),6407,
9417,Net Curr (Sun V (A)),Net Curr (Sun V (A)),6407,
9418,Net Curr (Sun V (B)),Net Curr (Sun V (B)),6407,
9419,Net Curr (Sun V (B)),Net Curr (Sun V (B)),6407,
9420,Net Curr (Sun V (C)),Net Curr (Sun V (C)),6407,
9421,Net Curr (Sun V (D)),Net Curr (Sun V (D)),6407,

6

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9423,Net Curr (SV Life Sciences IV (A)),Net Curr (SV Life Sciences IV (A)),1571,
9424,Net Curr (SV Life Sciences IV (B)),Net Curr (SV Life Sciences IV (B)),1571,
9425,Net Curr (SV Life Sciences IV (C)),Net Curr (SV Life Sciences IV (C)),1571,
9426,Net Curr (SV Life Sciences IV (D)),Net Curr (SV Life Sciences IV (D)),1571,
9427,Net Curr (SV Life Sciences IV (E)),Net Curr (SV Life Sciences IV (E)),1571,
9428,Net Curr (SV Life Sciences IV),Net Curr (SV Life Sciences IV),1571,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9434,Net Curr (Syntaxis Mezz (A)),Net Curr (Syntaxis Mezz (A)),3610,
9435,Net Curr (Syntaxis Mezz (B)),Net Curr (Syntaxis Mezz (B)),3610,
9436,Net Curr (Syntaxis Mezz),Net Curr (Syntaxis Mezz),3610,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9437,Net Curr (TA A&P V),Net Curr (TA A&P V),2075,
9443,Net Curr (TA X),Net Curr (TA X),2075,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9448,Net Curr (TCV V (A)),Net Curr (TCV V (A)),1269,
9449,Net Curr (TCV V (B)),Net Curr (TCV V (B)),1269,
9450,Net Curr (TCV V),Net Curr (TCV V),1269,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9451,Net Curr (TCV VI (A)),Net Curr (TCV VI (A)),3233,
9452,Net Curr (TCV VI (B)),Net Curr (TCV VI (B)),3233,
9453,Net Curr (TCV VI (C)),Net Curr (TCV VI (C)),3233,
9454,Net Curr (TCV VI),Net Curr (TCV VI),3233,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9458,Net Curr (TDR Capital II (A)),Net Curr (TDR Capital II (A)),2531,
9459,Net Curr (TDR Capital II (B)),Net Curr (TDR Capital II (B)),2531,
9460,Net Curr (TDR Capital II),Net Curr (TDR Capital II),2531,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9467,Net Curr (Terra Firma III (A)),Net Curr (Terra Firma III (A)),2377,
9468,Net Curr (Terra Firma III (B)),Net Curr (Terra Firma III (B)),2377,
9469,Net Curr (Terra Firma III),Net Curr (Terra Firma III),2377,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9480,Net Curr (Three Arch (A)),Net Curr (Three Arch (A)),2990,
9481,Net Curr (Three Arch (B)),Net Curr (Three Arch (B)),2990,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9483,Net Curr (Three Arch IV (A)),Net Curr (Three Arch IV (A)),4086,
9484,Net Curr (Three Arch IV (B)),Net Curr (Three Arch IV (B)),4086,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9496,Net Curr (TPG IV (A)),Net Curr (TPG IV (A)),3232,
9497,Net Curr (TPG IV (A)),Net Curr (TPG IV (A)),3232,
9498,Net Curr (TPG IV (B)),Net Curr (TPG IV (B)),3232,
9499,Net Curr (TPG IV (B)),Net Curr (TPG IV (B)),3232,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9500,Net Curr (TPG V (A)),Net Curr (TPG V (A)),7522,
9501,Net Curr (TPG V (B)),Net Curr (TPG V (B)),7522,
9502,Net Curr (TPG V (C)),Net Curr (TPG V (C)),7522,
9503,Net Curr (TPG V (D)),Net Curr (TPG V (D)),7522,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9504,Net Curr (TPG VI (A)),Net Curr (TPG VI (A)),3185,
9505,Net Curr (TPG VI (B)),Net Curr (TPG VI (B)),3185,
9506,Net Curr (TPG VI),Net Curr (TPG VI),3185,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9508,Net Curr (Trident V (A)),Net Curr (Trident V (A)),1711,
9509,Net Curr (Trident V (A)),Net Curr (Trident V (A)),1711,
9510,Net Curr (Trident V (B)),Net Curr (Trident V (B)),1711,
9511,Net Curr (Trident V (B)),Net Curr (Trident V (B)),1711,
9512,Net Curr (Trident V),Net Curr (Trident V),1711,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9526,Net Curr (Trumpet Feeder (A)),Net Curr (Trumpet Feeder (A)),875,
9527,Net Curr (Trumpet Feeder (B)),Net Curr (Trumpet Feeder (B)),875,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9530,Net Curr (Tullis II (A)),Net Curr (Tullis II (A)),1380,
9531,Net Curr (Tullis II (B)),Net Curr (Tullis II (B)),1380,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9532,Net Curr (Tullis III (A)),Net Curr (Tullis III (A)),1907,
9533,Net Curr (Tullis III (B)),Net Curr (Tullis III (B)),1907,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9551,Net Curr (USVP IX (A)),Net Curr (USVP IX (A)),2769,
9552,Net Curr (USVP IX (A)),Net Curr (USVP IX (A)),2769,
9553,Net Curr (USVP IX (B)),Net Curr (USVP IX (B)),2769,
9554,Net Curr (USVP IX (B)),Net Curr (USVP IX (B)),2769,
9555,Net Curr (USVP IX (C)),Net Curr (USVP IX (C)),2769,
9556,Net Curr (USVP IX (C)),Net Curr (USVP IX (C)),2769,
9557,Net Curr (USVP IX (D)),Net Curr (USVP IX (D)),2769,
9558,Net Curr (USVP IX),Net Curr (USVP IX),2769,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9566,Net Curr (VantagePoint V (A)),Net Curr (VantagePoint V (A)),7836,
9567,Net Curr (VantagePoint V (B)),Net Curr (VantagePoint V (B)),7836,
9568,Net Curr (VantagePoint V),Net Curr (VantagePoint V),7836,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9575,Net Curr (Venrock III (A)),Net Curr (Venrock III (A)),3772,
9576,Net Curr (Venrock III (B)),Net Curr (Venrock III (B)),3772,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9577,Net Curr (Venrock IV (A)),Net Curr (Venrock IV (A)),2225,
9578,Net Curr (Venrock IV (B)),Net Curr (Venrock IV (B)),2225,

7

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9589,Net Curr (Vestar V (A)),Net Curr (Vestar V (A)),2127,
9590,Net Curr (Vestar V (B)),Net Curr (Vestar V (B)),2127,
9591,Net Curr (Vestar V (C)),Net Curr (Vestar V (C)),2127,
9592,Net Curr (Vestar V (D)),Net Curr (Vestar V (D)),2127,
9593,Net Curr (Vestar V (E)),Net Curr (Vestar V (E)),2127,
9594,Net Curr (Vestar V (F)),Net Curr (Vestar V (F)),2127,
9595,Net Curr (Vestar V (G)),Net Curr (Vestar V (G)),2127,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9601,Net Curr (Viola Ventures II (A)),Net Curr (Viola Ventures II (A)),1933,
9602,Net Curr (Viola Ventures II (B)),Net Curr (Viola Ventures II (B)),1933,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9606,Net Curr (Vision VI B),Net Curr (Vision VI B),2221,
9607,Net Curr (Vision VI),Net Curr (Vision VI),2221,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9616,Net Curr (Warburg Pincus IX (A)),Net Curr (Warburg Pincus IX (A)),1649,
9617,Net Curr (Warburg Pincus IX (B)),Net Curr (Warburg Pincus IX (B)),1649,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9618,Net Curr (Water Street (A)),Net Curr (Water Street (A)),2104,
9619,Net Curr (Water Street (B)),Net Curr (Water Street (B)),2104,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9628,Net Curr (Weston Presidio V (A)),Net Curr (Weston Presidio V (A)),2631,
9629,Net Curr (Weston Presidio V (A)),Net Curr (Weston Presidio V (A)),2631,
9630,Net Curr (Weston Presidio V (B)),Net Curr (Weston Presidio V (B)),2631,
9631,Net Curr (Weston Presidio V (B)),Net Curr (Weston Presidio V (B)),2631,
9632,Net Curr (Weston Presidio V (C)),Net Curr (Weston Presidio V (C)),2631,
9633,Net Curr (Weston Presidio V (D)),Net Curr (Weston Presidio V (D)),2631,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9637,Net Curr (Wicks Comms & Media III (A)),Net Curr (Wicks Comms & Media III (A)),2717,
9638,Net Curr (Wicks Comms & Media III (B)),Net Curr (Wicks Comms & Media III (B)),2717,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9650,Net Curr (Worldview IV (A)),Net Curr (Worldview IV (A)),734,
9651,Net Curr (Worldview IV (B)),Net Curr (Worldview IV (B)),734,
9652,Net Curr (Worldview IV),Net Curr (Worldview IV),734,
9653,Net Curr (Worldview IV),Net Curr (Worldview IV),734,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9685,Net Current Assets (ABS Capital II (A)),Net Current Assets (ABS Capital II (A)),1938,
9686,Net Current Assets (ABS Capital II (B)),Net Current Assets (ABS Capital II (B)),1938,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9687,Net Current Assets (ABS Capital IV (A)),Net Current Assets (ABS Capital IV (A)),2698,
9688,Net Current Assets (ABS Capital IV (B)),Net Current Assets (ABS Capital IV (B)),2698,
9689,Net Current Assets (ABS Capital IV (C)),Net Current Assets (ABS Capital IV (C)),2698,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9690,Net Current Assets (Accel Europe (A)),Net Current Assets (Accel Europe (A)),1746,
9691,Net Current Assets (Accel Europe (B)),Net Current Assets (Accel Europe (B)),1746,
9692,Net Current Assets (Accel Europe),Net Current Assets (Accel Europe),1746,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9695,Net Current Assets (Accel VI - S),Net Current Assets (Accel VI - S),2425,
9696,Net Current Assets (Accel VI),Net Current Assets (Accel VI),2425,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9700,Net Current Assets (Act 2001),Net Current Assets (Act 2001),5086,
9701,Net Current Assets (ACT 2001),Net Current Assets (ACT 2001),5086,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9702,Net Current Assets (Act 94 (B)),Net Current Assets (Act 94 (B)),5028,
9703,Net Current Assets (Act 94),Net Current Assets (Act 94),5028,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9704,Net current Assets (Act 99 ( C)),Net current Assets (Act 99 ( C)),3603,
9705,Net current Assets (Act 99 (A)),Net current Assets (Act 99 (A)),3603,
9706,Net current Assets (Act 99 (B)),Net current Assets (Act 99 (B)),3603,
9710,Net Current Assets (ACT 99),Net Current Assets (ACT 99),3603,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9707,Net current Assets (ACT 99 Annex (A)),Net current Assets (ACT 99 Annex (A)),1691,
9708,Net current Assets (Act 99 Annex (B)),Net current Assets (Act 99 Annex (B)),1691,
9709,Net Current Assets (ACT 99 Annex),Net Current Assets (ACT 99 Annex),1691,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9715,Net Current Assets (Advent II (A)),Net Current Assets (Advent II (A)),2017,
9716,Net Current Assets (Advent II (B)),Net Current Assets (Advent II (B)),2017,

6

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9717,Net Current Assets (Advent III (A)),Net Current Assets (Advent III (A)),3461,
9718,Net Current Assets (Advent III (A)),Net Current Assets (Advent III (A)),3461,
9719,Net Current Assets (Advent III (B)),Net Current Assets (Advent III (B)),3461,
9720,Net Current Assets (Advent III (C)),Net Current Assets (Advent III (C)),3461,
9721,Net Current Assets (Advent III ('C)),Net Current Assets (Advent III ('C)),3461,
9722,Net Current Assets (Advent III (D)),Net Current Assets (Advent III (D)),3461,
9723,Net Current Assets (Advent III (D)),Net Current Assets (Advent III (D)),3461,
9724,Net Current Assets (Advent III (E)),Net Current Assets (Advent III (E)),3461,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9746,Net Current Assets (Ampersand 2001 (A)),Net Current Assets (Ampersand 2001 (A)),1578,
9747,Net Current Assets (Ampersand 2001),Net Current Assets (Ampersand 2001),1578,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9749,Net Current Assets (Apax IV (A)),Net Current Assets (Apax IV (A)),2151,
9750,Net current assets (Apax IV),Net current assets (Apax IV),2151,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9751,Net Current Assets (Apax V (B)),Net Current Assets (Apax V (B)),1949,
9752,Net Current Assets (Apax V),Net Current Assets (Apax V),1949,
9753,Net Current Assets (Apax V),Net Current Assets (Apax V),1949,
9754,Net Current Assets (Apax V),Net Current Assets (Apax V),1949,
9755,Net Current Assets (Apax V),Net Current Assets (Apax V),1949,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9761,Net Current Assets (Arcadia (B),Net Current Assets (Arcadia (B),1640,
9762,Net Current Assets (Arcadia),Net Current Assets (Arcadia),1640,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9764,Net Current Assets (Arch V (A)),Net Current Assets (Arch V (A)),1247,
9765,Net Current Assets (Arch V (B)),Net Current Assets (Arch V (B)),1247,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9780,Net Current Assets (Austin VIII (A)),Net Current Assets (Austin VIII (A)),3334,
9781,Net Current Assets (Austin VIII (B)),Net Current Assets (Austin VIII (B)),3334,
9782,Net Current Assets (Austin VIII),Net Current Assets (Austin VIII),3334,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9784,Net Current Assets (Bain VII (B)),Net Current Assets (Bain VII (B)),1839,
9785,Net Current Assets (Bain VII),Net Current Assets (Bain VII),1839,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9786,Net Current Assets (Baker II (A)),Net Current Assets (Baker II (A)),1334,
9787,Net Current Assets (Baker II),Net Current Assets (Baker II),1334,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9804,Net Current Assets (Blackstone Comm (B)),Net Current Assets (Blackstone Comm (B)),2977,
9805,Net Current Assets (Blackstone Comm),Net Current Assets (Blackstone Comm),2977,

5

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9806,Net Current Assets (Blackstone IV (A)),Net Current Assets (Blackstone IV (A)),1770,
9807,Net Current Assets (Blackstone IV (A)),Net Current Assets (Blackstone IV (A)),1770,
9808,Net Current Assets (Blackstone IV (D)),Net Current Assets (Blackstone IV (D)),1770,
9809,Net Current Assets (Blackstone IV (E)),Net Current Assets (Blackstone IV (E)),1770,
9810,Net Current Assets (Blackstone IV (F)),Net Current Assets (Blackstone IV (F)),1770,
9811,Net Current Assets (Blackstone IV),Net Current Assets (Blackstone IV),1770,
9812,Net Current Assets (Blackstone IV),Net Current Assets (Blackstone IV),1770,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9818,Net Current Assets (Bridgepoint II B),Net Current Assets (Bridgepoint II B),833,
9819,Net Current Assets (Bridgepoint II),Net Current Assets (Bridgepoint II),833,
9820,Net Current Assets (Bridgepoint II-C),Net Current Assets (Bridgepoint II-C),833,
9821,Net Current Assets (Bridgepoint II-C),Net Current Assets (Bridgepoint II-C),833,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9847,Net Current Assets (Chartwell II (A)),Net Current Assets (Chartwell II (A)),1177,
9848,Net Current Assets (Chartwell II (B)),Net Current Assets (Chartwell II (B)),1177,
9849,Net Current Assets (Chartwell II),Net Current Assets (Chartwell II),1177,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9852,Net Current Assets (Cinven III (B)),Net Current Assets (Cinven III (B)),2996,
9853,Net Current Assets (Cinven III (C)),Net Current Assets (Cinven III (C)),2996,
9854,Net Current Assets (Cinven III),Net Current Assets (Cinven III),2996,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9873,Net Current Assets (CVC III (A)),Net Current Assets (CVC III (A)),1593,
9874,Net Current Assets (CVC III (A)),Net Current Assets (CVC III (A)),1593,
9875,Net Current Assets (CVC III (B)),Net Current Assets (CVC III (B)),1593,
9876,Net Current Assets (CVC III (B)),Net Current Assets (CVC III (B)),1593,
9877,Net Current Assets (CVC III (C)),Net Current Assets (CVC III (C)),1593,
9878,Net Current Assets (CVC III (D)),Net Current Assets (CVC III (D)),1593,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9881,Net Current Assets (Darwin Venture FOF I),Net Current Assets (Darwin Venture FOF I),8,
9882,Net Current Assets (Darwin Venture FOF II),Net Current Assets (Darwin Venture FOF II),8,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9903,Net Current Assets (EQT III (B)),Net Current Assets (EQT III (B)),3379,
9904,Net Current Assets (EQT III),Net Current Assets (EQT III),3379,
9905,Net Current Assets (EQT III),Net Current Assets (EQT III),3379,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9920,Net Current Assets (Francisco Partners (A)),Net Current Assets (Francisco Partners (A)),3000,
9921,Net Current Assets (Francisco Partners (B)),Net Current Assets (Francisco Partners (B)),3000,
9922,Net Current Assets (Francisco Partners (C)),Net Current Assets (Francisco Partners (C)),3000,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9936,Net Current Assets (Green Equity IV (A)),Net Current Assets (Green Equity IV (A)),911,
9937,Net Current Assets (Green Equity IV (B)),Net Current Assets (Green Equity IV (B)),911,
9938,Net Current Assets (Green Equity IV (C)),Net Current Assets (Green Equity IV (C)),911,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9945,Net Current Assets (Harvest IV (A)),Net Current Assets (Harvest IV (A)),3015,
9946,Net Current Assets (Harvest IV (B)),Net Current Assets (Harvest IV (B)),3015,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9953,Net Current Assets (Highland VI (A)),Net Current Assets (Highland VI (A)),922,
9954,Net Current Assets (Highland VI (B)),Net Current Assets (Highland VI (B)),922,
9955,Net Current Assets (Highland VI),Net Current Assets (Highland VI),922,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9957,Net Current Assets (HMTF IV (A)),Net Current Assets (HMTF IV (A)),1176,
9958,Net Current Assets (HMTF IV (B)),Net Current Assets (HMTF IV (B)),1176,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9972,Net Current Assets (INCOM II (A)),Net Current Assets (INCOM II (A)),1733,
9973,Net Current Assets (Incom II (B)),Net Current Assets (Incom II (B)),1733,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9991,Net Current Assets (JW Childs III (A)),Net Current Assets (JW Childs III (A)),3016,
9992,Net Current Assets (JW Childs III (B)),Net Current Assets (JW Childs III (B)),3016,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
9999,Net Current Assets (Kohlberg TE IV (A)),Net Current Assets (Kohlberg TE IV (A)),1874,
10000,Net Current Assets (Kohlberg TE IV (B)),Net Current Assets (Kohlberg TE IV (B)),1874,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10018,Net Current Assets (MDP IV (B)),Net Current Assets (MDP IV (B)),2892,
10019,Net Current Assets (MDP IV),Net Current Assets (MDP IV),2892,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10022,Net Current Assets (Meritech II (A)),Net Current Assets (Meritech II (A)),3348,
10023,Net Current Assets (MeriTech II (B)),Net Current Assets (MeriTech II (B)),3348,
10024,Net current assets (Meritech II),Net current assets (Meritech II),3348,
10025,Net Current Assets (Meritech II),Net Current Assets (Meritech II),3348,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10030,Net Current Assets (Morgenthaler VII (A)),Net Current Assets (Morgenthaler VII (A)),1820,
10031,Net Current Assets (Morgenthaler VII),Net Current Assets (Morgenthaler VII),1820,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10044,Net Current Assets (NEA VIII - A),Net Current Assets (NEA VIII - A),1851,
10045,Net Current Assets (NEA VIII),Net Current Assets (NEA VIII),1851,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10046,Net Current Assets (NEA X (A)),Net Current Assets (NEA X (A)),3401,
10047,Net Current Assets (NEA X (A)),Net Current Assets (NEA X (A)),3401,
10048,Net Current Assets (NEA X (B)),Net Current Assets (NEA X (B)),3401,
10049,Net Current Assets (NEA X (B)),Net Current Assets (NEA X (B)),3401,
10050,Net Current Assets (NEA X (C)),Net Current Assets (NEA X (C)),3401,
10051,Net Current Assets (NEA X),Net Current Assets (NEA X),3401,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10065,Net Current Assets (Oak Hill Special Opps A),Net Current Assets (Oak Hill Special Opps A),1372,
10066,Net Current Assets (Oak Hill Special Opps B),Net Current Assets (Oak Hill Special Opps B),1372,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10097,Net Current Assets (Providence IV (A)),Net Current Assets (Providence IV (A)),1208,
10098,Net Current Assets (Providence IV (A)),Net Current Assets (Providence IV (A)),1208,
10099,Net Current Assets (Providence IV (C)),Net Current Assets (Providence IV (C)),1208,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10105,Net Current Assets (Quester (B)),Net Current Assets (Quester (B)),2474,
10106,Net Current Assets (Quester (B)),Net Current Assets (Quester (B)),2474,
10107,Net Current Assets (Quester),Net Current Assets (Quester),2474,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10114,Net Current Assets (Resolute Fund I),Net Current Assets (Resolute Fund I),1799,
10115,Net Current Assets (Resolute Fund I),Net Current Assets (Resolute Fund I),1799,
10116,Net Current Assets (Resolute Fund),Net Current Assets (Resolute Fund),1799,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10140,Net Current Assets (Sofinnova V (A)),Net Current Assets (Sofinnova V (A)),1464,
10141,Net Current Assets (Sofinnova V),Net Current Assets (Sofinnova V),1464,
10142,Net Current Assets (Sofinnova V),Net Current Assets (Sofinnova V),1464,

4

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10153,Net Current Assets (Summit VI (A)),Net Current Assets (Summit VI (A)),1747,
10154,Net Current Assets (Summit VI (A)),Net Current Assets (Summit VI (A)),1747,
10155,Net Current Assets (Summit VI (B)),Net Current Assets (Summit VI (B)),1747,
10156,Net Current Assets (Summit VI),Net Current Assets (Summit VI),1747,
10157,Net Current Assets (Summit VI-B),Net Current Assets (Summit VI-B),1747,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10192,Net current Assets (TVM V LS (B)),Net current Assets (TVM V LS (B)),5134,
10193,Net Current Assets (TVM V LS),Net Current Assets (TVM V LS),5134,
10194,Net current Assets (TVM V LS),Net current Assets (TVM V LS),5134,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10198,Net Current Assets (US Venture VIII (A)),Net Current Assets (US Venture VIII (A)),3277,
10199,Net Current Assets (US Venture VIII (A)),Net Current Assets (US Venture VIII (A)),3277,
10200,Net Current Assets (US Venture VIII (C)),Net Current Assets (US Venture VIII (C)),3277,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10206,Net current assets (Ventech A),Net current assets (Ventech A),1591,
10207,Net current assets (Ventech B),Net current assets (Ventech B),1591,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10208,Net Current Assets (Versant I),Net Current Assets (Versant I),454,
10209,Net Current Assets (Versant),Net Current Assets (Versant),454,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10215,Net Current Assets (WCAS IX (B)),Net Current Assets (WCAS IX (B)),1713,
10216,Net Current Assets (WCAS IX),Net Current Assets (WCAS IX),1713,
10217,Net Current Assets (WCAS IX),Net Current Assets (WCAS IX),1713,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10218,Net Current Assets (WCAS VIII (A)),Net Current Assets (WCAS VIII (A)),2588,
10219,Net Current Assets (WCAS VIII (B)),Net Current Assets (WCAS VIII (B)),2588,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10220,Net Current Assets (Wellington II (A)),Net Current Assets (Wellington II (A)),5932,
10221,Net Current Assets (Wellington II (A)),Net Current Assets (Wellington II (A)),5932,
10222,Net Current Assets (Wellington II (B)),Net Current Assets (Wellington II (B)),5932,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10231,Net Current Assets (Wicks C&M III),Net Current Assets (Wicks C&M III),3408,
10232,Net Current Assets (Wicks III),Net Current Assets (Wicks III),3408,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10272,NeurogesX,NeurogesX,1194,
10273,NeurogesX Inc,NeurogesX,1194,
10274,"Neurogesx, Inc.",Neurogesx,1194,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10446,Nexus India Capital,Nexus India Capital,694,
10447,"Nexus India Capital I, L.P",Nexus India Capital I,694,
10448,"Nexus India Capital I, L.P",Nexus India Capital I,694,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10547,Non Control Investments,Non Control Investments,206,
10548,Non Control Investments,Non Control Investments,206,
10549,Non Control Investments,Non Control Investments,206,
10554,Non-Control Investments,Non-Control Investments,206,
10555,Non-Control Investments,Non-Control Investments,206,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10611,Nostrum Oil & Gas,Nostrum Oil & Gas,2522,
10612,Nostrum Oil & Gas,Nostrum Oil & Gas,2522,
10613,Nostrum Oil & Gas,Nostrum Oil & Gas,2522,
10614,Nostrum Oil & Gas,Nostrum Oil & Gas,2522,
10615,Nostrum Oil&Gas,Nostrum Oil&Gas,2522,
10616,Nostrum Oil&Gas,Nostrum Oil&Gas,2522,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10793,OMNIPV,OMNIPV,385,
10794,OMNIPV,OMNIPV,385,
10795,"OmniPV, Inc.",OmniPV,385,
10796,"OmniPV, Inc.",OmniPV,385,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10797,Omniticket,Omniticket,1006,
10798,OmniTicket,OmniTicket,1006,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10904,Optiscan Biomedical,Optiscan Biomedical,1677,
10905,Optiscan Biomedical,Optiscan Biomedical,1677,
10906,OptiScan Biomedical Corp.,OptiScan Biomedical,1677,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
10915,Orametrix,Orametrix,753,
10916,Orametrix,Orametrix,753,
10917,Orametrix,Orametrix,753,
10918,Orametrix,Orametrix,753,
10919,"OraMetrix, Inc.",OraMetrix,753,
10920,"OraMetrix, Inc.",OraMetrix,753,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
11444,PLASE Capital Group,PLASE Capital Group,1693,
11445,PLASE Capital Group,PLASE Capital Group,1693,
11446,PLASE Capital Group,PLASE Capital Group,1693,
11447,PLASE Capital Group,PLASE Capital Group,1693,
11448,"Plase Capital Group, L.P.",Plase Capital Group,1693,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
11813,QAPA,QAPA,260,
11814,QAPA,QAPA,260,
11815,QAPA,QAPA,260,
11816,Qapa,Qapa,260,
11817,QAPA,QAPA,260,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
11825,Qiming Biopharma,Qiming Biopharma,1729,
11826,Qiming BioPharma,Qiming BioPharma,1729,
11827,Qiming BioPharma,Qiming BioPharma,1729,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
11831,QM21,QM21,1158,
11832,Qm21,Qm21,1158,
11833,Qm21,Qm21,1158,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
11862,Quantel Holdings,Quantel Holdings,1559,
11863,Quantel Holdings,Quantel Holdings,1559,
11870,Quantel Holdings 2,Quantel Holdings 2,1559,
11871,Quantel Holdings 2,Quantel Holdings 2,1559,
11872,Quantel Holdings 2,Quantel Holdings 2,1559,
11873,Quantel Holdings 2,Quantel Holdings 2,1559,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
11999,RebTel,RebTel,100,
12000,Rebtel,Rebtel,100,
12001,Rebtel,Rebtel,100,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
12070,Relievant MedSystems,Relievant MedSystems,1063,
12071,Relievant Medsystems,Relievant Medsystems,1063,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
12098,Rent The Runway,Rent The Runway,668,
12099,Rent the Runway,Rent the Runway,668,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
12110,Reshape LifeSciences,Reshape LifeSciences,426,
12111,ReShape Lifesciences,ReShape Lifesciences,426,
12112,ReShape Lifesciences,ReShape Lifesciences,426,
12113,ReShape Lifesciences,ReShape Lifesciences,426,
12114,ReShape Lifesciences,ReShape Lifesciences,426,
12115,ReShape Lifesciences,ReShape Lifesciences,426,
12116,ReShape Lifesciences,ReShape Lifesciences,426,
12117,Reshape Lifesciences,Reshape Lifesciences,426,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
12129,RespiCardia,RespiCardia,129,
12130,RespiCardia,RespiCardia,129,
12131,Respicardia,Respicardia,129,
12132,"Respicardia, Inc.",Respicardia,129,
12133,"Respicardia, Inc.",Respicardia,129,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
12410,Sankaty Special Situations,Sankaty Special Situations,5424,
12411,Sankaty Special Situations,Sankaty Special Situations,5424,
12412,Sankaty Special Situations I,Sankaty Special Situations I,5424,
12413,Sankaty Special Situations I,Sankaty Special Situations I,5424,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
12570,Seedworks Holdings Mauritius,Seedworks Holdings Mauritius,1,
12571,Seedworks Holdings Mauritius II,Seedworks Holdings Mauritius II,1,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
12714,"SFJ NSCLC, L.P.",SFJ NSCLC,1466,
12716,SFJ-NSCLC,SFJ-NSCLC,1466,
12717,SFJ-NSCLC,SFJ-NSCLC,1466,
12718,SFJ-NSCLC,SFJ-NSCLC,1466,
12719,SFJ-NSCLC LP,SFJ-NSCLC,1466,
12720,SFJ-NSCLC LP,SFJ-NSCLC,1466,
12721,SFJ-NSCLC LP,SFJ-NSCLC,1466,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
12748,Shapes/Arch Holdings,Shapes/Arch Holdings,1384,
12749,Shapes/Arch Holdings,Shapes/Arch Holdings,1384,
12750,Shapes/Arch Holdings,Shapes/Arch Holdings,1384,
12751,Shapes/Arch Holdings,Shapes/Arch Holdings,1384,
12755,Shapes/Arch Holdings L L C,Shapes/Arch Holdings L L C,1384,
12756,Shapes/Arch Holdings L L C,Shapes/Arch Holdings L L C,1384,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
12971,SK Consortium 1,SK Consortium 1,1690,
12972,SK Consortium 1 S.à r.l.,SK Consortium 1 S.à r.l.,1690,
12973,SK Consortium 1 S.à r.l.,SK Consortium 1 S.à r.l.,1690,
12974,SK Consortium 1 S.à r.l.,SK Consortium 1 S.à r.l.,1690,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
12975,SK Rezerve,SK Rezerve,78,
12976,SK Rezerve,SK Rezerve,78,
12985,SK-Rezerve,SK-Rezerve,78,
12986,SK-Rezerve,SK-Rezerve,78,
12987,SK-Rezerve,SK-Rezerve,78,
12988,SK-Rezerve,SK-Rezerve,78,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
13166,SoundCloud,SoundCloud,1950,
13167,Soundcloud Ltd.,Soundcloud,1950,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
13259,Spinevision Sa,Spinevision,486,
13260,SpineVision SA,SpineVision,486,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
13363,StarTech Seed Fund II,StarTech Seed Fund II,919,
13364,StarTech Seed Fund II,StarTech Seed Fund II,919,
13365,"STARTech Seed Fund II, L.P.",STARTech Seed Fund II,919,
13366,"STARTech Seed Fund II, L.P.",STARTech Seed Fund II,919,
13367,"STARTech Seed Fund II, LP",STARTech Seed Fund II,919,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
13489,SunGard,SunGard,375,
13490,SunGard,SunGard,375,
13491,SunGard,SunGard,375,
13492,SunGard,SunGard,375,
13493,SunGard,SunGard,375,
13494,Sungard,Sungard,375,
13495,Sungard,Sungard,375,
13496,Sungard,Sungard,375,
13497,Sungard,Sungard,375,
13498,Sungard,Sungard,375,
13499,Sungard,Sungard,375,
13500,Sungard,Sungard,375,
13501,SunGard,SunGard,375,
13502,SunGard,SunGard,375,
13503,SunGard,SunGard,375,
13504,SunGard,SunGard,375,
13505,SunGard,SunGard,375,
13506,SunGard,SunGard,375,
13507,Sungard,Sungard,375,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
13647,SynSam,SynSam,376,
13648,Synsam,Synsam,376,
13649,Synsam,Synsam,376,
13650,Synsam,Synsam,376,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
13692,Takadu,Takadu,241,
13693,TaKaDu Ltd,TaKaDu,241,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
13773,TARIS Holdings,TARIS Holdings,2890,
13774,Taris Holdings,Taris Holdings,2890,
13775,Taris Holdings,Taris Holdings,2890,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
14078,The Winebow Group,The Winebow Group,3087,
14079,The WineBow Group,The WineBow Group,3087,
14080,The Winebow Group,The Winebow Group,3087,
14081,The Winebow Group,The Winebow Group,3087,

3

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
14129,ThredUp,ThredUp,210,
14130,ThredUP,ThredUP,210,
14131,ThredUp,ThredUp,210,
14132,Thredup,Thredup,210,
14133,Thredup,Thredup,210,
14134,Thredup,Thredup,210,
14135,ThredUp Inc.,ThredUp,210,
14136,ThredUp Inc.,ThredUp,210,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
14137,ThreeSixty Sourcing,ThreeSixty Sourcing,1059,
14138,Threesixty Sourcing,Threesixty Sourcing,1059,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
14287,"Toys ""R"" Us, Inc.","Toys ""R"" Us",115,
14288,Toys 'R' Us,Toys 'R' Us,115,
14289,"Toys 'R' Us, Inc.",Toys 'R' Us,115,
14290,"Toys 'R' Us, Inc.",Toys 'R' Us,115,
14291,"Toys 'R' Us, Inc.",Toys 'R' Us,115,
14292,"Toys 'R' Us, Inc.",Toys 'R' Us,115,
14293,"Toys 'R' Us, Inc.",Toys 'R' Us,115,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
14373,Tria Beauty,Tria Beauty,5046,
14374,"TRIA Beauty, Inc.",TRIA Beauty,5046,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
14627,U-Pol,U-Pol,257,
14628,U-POL,U-POL,257,
14629,U-POL,U-POL,257,
14630,U-POL,U-POL,257,
14631,U-POL,U-POL,257,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
14747,Vbrick Systems,Vbrick Systems,3449,
14748,"VBrick Systems, Inc.",VBrick Systems,3449,
14749,"VBrick Systems, Inc.",VBrick Systems,3449,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
14945,Vionx Energy,Vionx Energy,1718,
14946,Vionx Energy,Vionx Energy,1718,
14947,VionX Energy Corp,VionX Energy,1718,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
14978,VisionCare Ophthalmic Technologies,VisionCare Ophthalmic Technologies,182,
14979,"Visioncare Ophthalmic Technologies, Inc.",Visioncare Ophthalmic Technologies,182,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
15138,Webtrends,Webtrends,23,
15139,WebTrends,WebTrends,23,
15140,WebTrends,WebTrends,23,
15141,WebTrends,WebTrends,23,
15142,WebTrends,WebTrends,23,
15143,WebTrends,WebTrends,23,
15144,WebTrends,WebTrends,23,
15145,WebTrends,WebTrends,23,
15146,WebTrends,WebTrends,23,
15147,WebTrends,WebTrends,23,
15148,WebTrends,WebTrends,23,
15149,WebTrends,WebTrends,23,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
15213,Wildtangent,Wildtangent,558,
15214,Wildtangent,Wildtangent,558,
15215,WildTangent,WildTangent,558,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
15259,Wooga,Wooga,5240,
15261,wooga GmbH,wooga,5240,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
15274,Worldpay,Worldpay,25,
15275,Worldpay,Worldpay,25,
15276,Worldpay,Worldpay,25,
15277,Worldpay,Worldpay,25,
15278,Worldpay,Worldpay,25,
15279,Worldpay,Worldpay,25,
15280,WorldPay,WorldPay,25,
15281,Worldpay,Worldpay,25,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
15447,YeePay,YeePay,15,
15448,YeePay,YeePay,15,
15449,YeePay,YeePay,15,
15450,Yeepay,Yeepay,15,
15451,Yeepay,Yeepay,15,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
15554,Zoominfo,Zoominfo,3759,
15555,ZoomInfo,ZoomInfo,3759,
15556,ZoomInfo,ZoomInfo,3759,
15557,ZoomInfo,ZoomInfo,3759,

2

,Original Company Name,Cleaned Name,Cluster_labels,Proposed Standardised Name
15558,ZoomInfo (Tax Receivable),ZoomInfo (Tax Receivable),5931,
15559,ZoomInfo Tax receivable,ZoomInfo Tax receivable,5931,

In [23]:
saved_name = 'StandardisedCompanyNames.xlsx'
path =  f'C:/Users/aneave/OneDrive/Documents/Naming Conventions/Standardising Company Names/{saved_name}'
df.to_excel(path,index=False)